app/Http/Controllers/Api/User/AuthorizationController.php

        ];
        DB::beginTransaction();
        try{
            $oldToken = UserAuthorization::where("phone",$validated['phone'])->get();
---
select * from `user_authorizations` where `phone` = '1777777778'

    public function verifySms(Request $request){
        $validator = Validator::make($request->all(), [
            'phone'   => "required",
            'code'    => "required|max:6",
        ]);
        if($validator->fails()){
            $error =  ['error'=>$validator->errors()->all()];
            return Helpers::validation($error);
        }
        $code = $request->code;
        $otp_exp_sec = BasicSettingsProvider::get()->otp_exp_seconds ?? GlobalConst::DEFAULT_TOKEN_EXP_SEC;
        $auth_column = UserAuthorization::where("phone",$request->phone)->where("code",$code)->first();
        if(!$auth_column){
            $message = ['error'=>[__('The verification code does not match')]];
            return Helpers::error($message);
        }
        if($auth_column->created_at->addSeconds($otp_exp_sec) < now()) {
            $auth_column->delete();
            $message = ['error'=>[__('Verification code is expired')]];
            return Helpers::error($message);
        }
        try{
            $auth_column->delete();
---
delete from `user_authorizations` where `id` = 50