app/Http/Controllers/Api/User/MakePaymentController.php

    public function checkMerchant(Request $request){
        $validator = Validator::make(request()->all(), [
            'username'     => "required",
        ]);
        if($validator->fails()){
            $error =  ['error'=>$validator->errors()->all()];
            return Helpers::validation($error);
        }
        $exist = Merchant::where('username',$request->username)->first();
---
select * from `merchants` where `username` = 'testmerchant' limit 1