app/Http/Controllers/Api/User/RequestMoneyController.php

    public function index()
    {

        $user = auth()->user();
        $requestMoneyCharge = TransactionSetting::where('slug','request-money')->where('status',1)->get()->map(function($data){
            return[
                'id' => $data->id,
                'slug' => $data->slug,
                'title' => $data->title,
                'fixed_charge' => getAmount($data->fixed_charge,2),
                'percent_charge' => getAmount($data->percent_charge,2),
                'min_limit' => getAmount($data->min_limit,2),
                'max_limit' => getAmount($data->max_limit,2),
                'monthly_limit' => getAmount($data->monthly_limit,2),
                'daily_limit' => getAmount($data->daily_limit,2),
            ];
        })->first();
        $transactions = Transaction::auth()->requestMoney()->latest()->take(10)->get()->map(function($item){
                if($item->attribute == payment_gateway_const()::SEND){
                    return[
                        'id' => $item->id,
                        'title' => "Request Money to @" . $item->details->receiver_username,
                        'trx' => $item->trx_id,
                        'attribute' => $item->attribute,
                        'type' => $item->type,
                        'request_amount' =>  get_amount($item->request_amount,$item->creator_wallet->currency->code),
                        'payable_amount' => '',
                        'total_charge' => "",
                        'will_get' =>  get_transaction_numeric_attribute_request_money($item->attribute).' '.get_amount($item->details->charges->receiver_amount,$item->details->charges->receiver_currency),
                        'status' => $item->stringStatus->value,
                        'remark' => $item->remark??'',
                        'created_at' => $item->created_at,
                    ];
                }elseif($item->attribute == payment_gateway_const()::RECEIVED){
                    return[
                        'id' => $item->id,
                        'title' => "Request Money from @" . $item->details->sender_username,
                        'trx' => $item->trx_id,
---
select * from `transaction_settings` where `slug` = 'request-money' and `status` = 1
select * from `transactions` where `user_id` = 1 and `type` = 'REQUEST-MONEY' order by `created_at` desc limit 10

                }

        });
        $userWallet = UserWallet::where('user_id',$user->id)->get()->map(function($data){
            return[
                'balance' => getAmount($data->balance,2),
                'currency' => get_default_currency_code(),
            ];
        })->first();
---
select * from `user_wallets` where `user_id` = 1