app/Http/Controllers/Api/User/SendMoneyController.php

select * from `basic_settings` limit 1
select * from `transaction_settings` where `slug` = 'transfer' and `status` = 1 limit 1
select * from `user_wallets` where `user_id` = 1 limit 1
---
    public function confirmedSendMoney(Request $request){
        $validator = Validator::make(request()->all(), [
            'amount' => 'required|numeric|gt:0',
            'username' => 'required'
        ]);
        if($validator->fails()){
            $error =  ['error'=>$validator->errors()->all()];
            return Helpers::validation($error);
        }
        $basic_setting = BasicSettings::first();
        $user = auth()->user();
        if($basic_setting->kyc_verification){
            if( $user->kyc_verified == 0){
                $error = ['error'=>[__('Please submit kyc information!')]];
                return Helpers::error($error);
            }elseif($user->kyc_verified == 2){
                $error = ['error'=>[__('Please wait before admin approves your kyc information')]];
                return Helpers::error($error);
            }elseif($user->kyc_verified == 3){
                $error = ['error'=>[__('Admin rejected your kyc information, Please re-submit again')]];
                return Helpers::error($error);
            }
        }
        $amount = $request->amount;
        $user = auth()->user();
        $sendMoneyCharge = TransactionSetting::where('slug','transfer')->where('status',1)->first();
        $userWallet = UserWallet::where('user_id',$user->id)->first();

select * from `users` where `username` = 'testuser2' limit 1
---
        }
        $rate = $baseCurrency->rate;
        $username = $request->username;
        $receiver = User::where('username',$username)->first();

select * from `user_wallets` where `user_id` = 2 limit 1
---
            $error = ['error'=>[__("Can't send money to your own")]];
            return Helpers::error($error);
        }
        $receiverWallet = UserWallet::where('user_id',$receiver->id)->first();

update `user_wallets` set `balance` = 988.9, `user_wallets`.`updated_at` = '2024-07-30 19:06:56' where `id` = 1
---
     public function insertSender($trx_id,$user,$userWallet,$amount,$recipient,$payable,$receiver) {
        $trx_id = $trx_id;
        $authWallet = $userWallet;
        $afterCharge = ($authWallet->balance - $payable);
        $details =[
            'recipient_amount' => $recipient,
            'receiver' => $receiver,
        ];
        DB::beginTransaction();
        try{
            $id = DB::table("transactions")->insertGetId([
                'user_id'                       => $user->id,
                'user_wallet_id'                => $authWallet->id,
                'payment_gateway_currency_id'   => null,
                'type'                          => PaymentGatewayConst::TYPETRANSFERMONEY,
                'trx_id'                        => $trx_id,
                'request_amount'                => $amount,
                'payable'                       => $payable,
                'available_balance'             => $afterCharge,
                'remark'                        => ucwords(remove_speacial_char(PaymentGatewayConst::TYPETRANSFERMONEY," ")) . " To " .$receiver->fullname,
                'details'                       => json_encode($details),
                'attribute'                      =>PaymentGatewayConst::SEND,
                'status'                        => true,
                'created_at'                    => now(),
            ]);
            $this->updateSenderWalletBalance($authWallet,$afterCharge);

insert into `transaction_charges` (`transaction_id`, `percent_charge`, `fixed_charge`, `total_charge`, `created_at`) values (1, 0.1, 1, 1.1, '2024-07-30 19:06:56')
insert into `user_notifications` (`type`, `user_id`, `message`, `updated_at`, `created_at`) values ('TRANSFER-MONEY', 1, '{\"title\":\"Send Money\",\"message\":\"Transfer Money to Test User2 10 USD Successful\",\"image\":\"http:\/\/127.0.0.1\/customization\/paywai\/public\/backend\/images\/default\/profile-default.webp\"}', '2024-07-30 19:06:56', '2024-07-30 19:06:56')
insert into `admin_notifications` (`type`, `admin_id`, `message`, `updated_at`, `created_at`) values ('TRANSFER-MONEY', 1, '{\"title\":\"Transfer Money Send To (testuser2)\",\"message\":\"Transfer Money to Test User2 10 USD Successful\",\"image\":\"http:\/\/127.0.0.1\/customization\/paywai\/public\/backend\/images\/default\/profile-default.webp\"}', '2024-07-30 19:06:56', '2024-07-30 19:06:56')
---
    public function insertSenderCharges($fixedCharge,$percent_charge, $total_charge, $amount,$user,$id,$receiver) {
        DB::beginTransaction();
        try{
            DB::table('transaction_charges')->insert([
                'transaction_id'    => $id,
                'percent_charge'    => $percent_charge,
                'fixed_charge'      =>$fixedCharge,
                'total_charge'      =>$total_charge,
                'created_at'        => now(),
            ]);
            DB::commit();

            //notification
            $notification_content = [
                'title'         => __("Send Money"),
                'message'       => __('Transfer Money to')." ".$receiver->fullname.' ' .$amount.' '.get_default_currency_code()." ".__('Successful'),
                'image'         => files_asset_path('profile-default'),
            ];

            UserNotification::create([
                'type'      => NotificationConst::TRANSFER_MONEY,
                'user_id'  => $user->id,
                'message'   => $notification_content,
            ]);

             //admin create notifications
             $notification_content['title'] = __('Transfer Money Send To').' ('.$receiver->username.')';
             AdminNotification::create([
                 'type'      => NotificationConst::TRANSFER_MONEY,
                 'admin_id'  => 1,
                 'message'   => $notification_content,
             ]);

update `user_wallets` set `balance` = 1010, `user_wallets`.`updated_at` = '2024-07-30 19:06:57' where `id` = 2
---
    public function insertReceiver($trx_id,$user,$userWallet,$amount,$recipient,$payable,$receiver,$receiverWallet) {
        $trx_id = $trx_id;
        $receiverWallet = $receiverWallet;
        $recipient_amount = ($receiverWallet->balance + $recipient);
        $details =[
            'sender_amount' => $amount,
            'sender' => $user,
        ];
        DB::beginTransaction();
        try{
            $id = DB::table("transactions")->insertGetId([
                'user_id'                       => $receiver->id,
                'user_wallet_id'                => $receiverWallet->id,
                'payment_gateway_currency_id'   => null,
                'type'                          => PaymentGatewayConst::TYPETRANSFERMONEY,
                'trx_id'                        => $trx_id,
                'request_amount'                => $amount,
                'payable'                       => $payable,
                'available_balance'             => $recipient_amount,
                'remark'                        => ucwords(remove_speacial_char(PaymentGatewayConst::TYPETRANSFERMONEY," ")) . " From " .$user->fullname,
                'details'                       => json_encode($details),
                'attribute'                      =>PaymentGatewayConst::RECEIVED,
                'status'                        => true,
                'created_at'                    => now(),
            ]);
            $this->updateReceiverWalletBalance($receiverWallet,$recipient_amount);

insert into `transaction_charges` (`transaction_id`, `percent_charge`, `fixed_charge`, `total_charge`, `created_at`) values (2, 0.1, 1, 1.1, '2024-07-30 19:06:57')
insert into `user_notifications` (`type`, `user_id`, `message`, `updated_at`, `created_at`) values ('TRANSFER-MONEY', 2, '{\"title\":\"Send Money\",\"message\":\"Transfer Money from Test User 10 USD Successful\",\"image\":\"http:\/\/127.0.0.1\/customization\/paywai\/public\/backend\/images\/default\/profile-default.webp\"}', '2024-07-30 19:06:57', '2024-07-30 19:06:57')
insert into `admin_notifications` (`type`, `admin_id`, `message`, `updated_at`, `created_at`) values ('TRANSFER-MONEY', 1, '{\"title\":\"Transfer Money Received From (appdevs)\",\"message\":\"Transfer Money from Test User 10 USD Successful\",\"image\":\"http:\/\/127.0.0.1\/customization\/paywai\/public\/backend\/images\/default\/profile-default.webp\"}', '2024-07-30 19:06:57', '2024-07-30 19:06:57')
---
    public function insertReceiverCharges($fixedCharge,$percent_charge, $total_charge, $amount,$user,$id,$receiver) {
        DB::beginTransaction();
        try{
            DB::table('transaction_charges')->insert([
                'transaction_id'    => $id,
                'percent_charge'    => $percent_charge,
                'fixed_charge'      =>$fixedCharge,
                'total_charge'      =>$total_charge,
                'created_at'        => now(),
            ]);
            DB::commit();

            //notification
            $notification_content = [
                'title'         => __("Send Money"),
                'message'       => __('Transfer Money from')." ".$user->fullname.' ' .$amount.' '.get_default_currency_code()." ".__('Successful'),
                'image'         => files_asset_path('profile-default'),
            ];

            UserNotification::create([
                'type'      => NotificationConst::TRANSFER_MONEY,
                'user_id'  => $receiver->id,
                'message'   => $notification_content,
            ]);

             //admin notification
             $notification_content['title'] = __('Transfer Money Received From').' ('.$user->username.')';
            AdminNotification::create([
                'type'      => NotificationConst::TRANSFER_MONEY,
                'admin_id'  => 1,
                'message'   => $notification_content,
            ]);