app/Http/Controllers/User/AgentMoneyOutController.php

select * from `transaction_settings` where `slug` = 'money-out' and `status` = 1 limit 1
select * from `transactions` where `user_id` = 1 and `type` = 'AGENT-MONEY-OUT' order by `created_at` desc limit 10
---
    public function index() {
        $page_title = __("Money Out");
        $moneyOutCharge = TransactionSetting::where('slug','money-out')->where('status',1)->first();
        $transactions = Transaction::auth()->agentMoneyOut()->latest()->take(10)->get();

select * from `agents` where `username` = 'te' limit 1
---
    public function checkAgent(Request $request){
        $username = $request->username;
        $exist['data'] = Agent::where('username',$username)->first();