app/Http/Controllers/User/DashboardController.php

    public function index()
    {
        $page_title =__( "Dashboard");
        $baseCurrency = Currency::default();
        $transactions = Transaction::with(['merchant'])->auth()->latest()->take(5)->get();
        $data['totalReceiveRemittance'] =Transaction::auth()->remitance()->where('attribute',"RECEIVED")->where('status',1)->sum('request_amount');
        $data['totalSendRemittance'] =Transaction::auth()->remitance()->where('attribute',"SEND")->where('status',1)->sum('request_amount');
        $data['cardAmount'] = userActiveCardData()['total_balance'];

        $data['billPay'] = Transaction::auth()->billPay()->where('status',1)->sum('request_amount');
        $data['topUps'] = Transaction::auth()->mobileTopup()->where('status',1)->sum('request_amount');
        $data['withdraw'] = Transaction::auth()->moneyOut()->where('status',1)->sum('request_amount');
        $data['total_transaction'] = Transaction::auth()->where('status', 1)->count();
---
select * from `merchants` where 0 = 1
select * from `transactions` where `user_id` = 1 order by `created_at` desc limit 5
select sum(`request_amount`) as aggregate from `transactions` where `user_id` = 1 and `type` = 'REMITTANCE' and `attribute` = 'RECEIVED' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `user_id` = 1 and `type` = 'REMITTANCE' and `attribute` = 'SEND' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `user_id` = 1 and `type` = 'BILL-PAY' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `user_id` = 1 and `type` = 'MOBILE-TOPUP' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `user_id` = 1 and `type` = 'MONEY-OUT' and `status` = 1
select count(*) as aggregate from `transactions` where `user_id` = 1 and `status` = 1

            $start_date = date('Y-m-d', $start);

            // Monthley add money
            $pending = Transaction::auth()->where('type', PaymentGatewayConst::TYPEADDMONEY)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 2)
                                        ->count();
            $success = Transaction::auth()->where('type', PaymentGatewayConst::TYPEADDMONEY)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 1)
                                        ->count();
            $canceled = Transaction::auth()->where('type', PaymentGatewayConst::TYPEADDMONEY)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 4)
                                        ->count();
            $hold = Transaction::auth()->where('type', PaymentGatewayConst::TYPEADDMONEY)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 3)
                                        ->count();
---
select count(*) as aggregate from `transactions` where `user_id` = 1 and `type` = 'ADD-MONEY' and date(`created_at`) = '2024-07-01' and `status` = 2
select count(*) as aggregate from `transactions` where `user_id` = 1 and `type` = 'ADD-MONEY' and date(`created_at`) = '2024-07-01' and `status` = 1
select count(*) as aggregate from `transactions` where `user_id` = 1 and `type` = 'ADD-MONEY' and date(`created_at`) = '2024-07-01' and `status` = 4
select count(*) as aggregate from `transactions` where `user_id` = 1 and `type` = 'ADD-MONEY' and date(`created_at`) = '2024-07-01' and `status` = 3

            $hold_data[]     = $hold;

              // Monthley money Out
              $money_pending = Transaction::auth()->where('type', PaymentGatewayConst::TYPEMONEYOUT)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 2)
                                        ->count();
            $money_success = Transaction::auth()->where('type', PaymentGatewayConst::TYPEMONEYOUT)
                                ->whereDate('created_at',$start_date)
                                ->where('status', 1)
                                ->count();
            $money_canceled = Transaction::auth()->where('type', PaymentGatewayConst::TYPEMONEYOUT)
                                ->whereDate('created_at',$start_date)
                                ->where('status', 4)
                                ->count();
            $money_hold = Transaction::auth()->where('type', PaymentGatewayConst::TYPEMONEYOUT)
                            ->whereDate('created_at',$start_date)
                            ->where('status', 3)
                            ->count();
---
select count(*) as aggregate from `transactions` where `user_id` = 1 and `type` = 'MONEY-OUT' and date(`created_at`) = '2024-07-01' and `status` = 2
select count(*) as aggregate from `transactions` where `user_id` = 1 and `type` = 'MONEY-OUT' and date(`created_at`) = '2024-07-01' and `status` = 1
select count(*) as aggregate from `transactions` where `user_id` = 1 and `type` = 'MONEY-OUT' and date(`created_at`) = '2024-07-01' and `status` = 4
select count(*) as aggregate from `transactions` where `user_id` = 1 and `type` = 'MONEY-OUT' and date(`created_at`) = '2024-07-01' and `status` = 3

    public function qrScan($qr_code)
    {
        header("Access-Control-Allow-Origin: *");
        header("Access-Control-Allow-Methods: PUT, GET, POST");
        header("Access-Control-Allow-Headers: Origin, X-Requested-With, Content-Type, Accept");
        $qrCode = UserQrCode::where('qr_code',$qr_code)->where(function ($query) {
            $query->whereNull('sender_type')
                  ->orWhere('sender_type', GlobalConst::SENDER_TYPE_USER);
        })
        ->first();
        if(!$qrCode){
            return response()->json(['error'=>__("Invalid request")]);
        }
        $user = User::find($qrCode->user_id);
---
select * from `user_qr_codes` where `qr_code` = '{\"receiver_type\":\"User\",\"sender_type\":\"User\",\"username\":\"testuser2\",\"amount\":null}' and (`sender_type` is null or `sender_type` = 'User') limit 1
select * from `users` where `users`.`id` = 2 limit 1