app/Http/Controllers/User/MakePaymentController.php

    public function index() {
        $page_title = __("Make Payment");
        $makePaymentCharge = TransactionSetting::where('slug','make-payment')->where('status',1)->first();
        $transactions = Transaction::auth()->makePayment()->latest()->take(10)->get();
---
select * from `transaction_settings` where `slug` = 'make-payment' and `status` = 1 limit 1
select * from `transactions` where `user_id` = 1 and `type` = 'MAKE-PAYMENT' order by `created_at` desc limit 10

    public function checkUser(Request $request){
        $username = $request->username;

        $exist['data'] = Merchant::where('username',$username)->first();
---
select * from `merchants` where `username` = 'testmerchant' limit 1

    public function confirmed(Request $request){
        $request->validate([
            'amount' => 'required|numeric|gt:0',
            'username' => 'required'
        ]);
        $basic_setting = BasicSettings::first();
        $user = auth()->user();
        if($basic_setting->kyc_verification){
            if( $user->kyc_verified == 0){
                return redirect()->route('user.profile.index')->with(['error' => [__('Please submit kyc information!')]]);
            }elseif($user->kyc_verified == 2){
                return redirect()->route('user.profile.index')->with(['error' => [__('Please wait before admin approves your kyc information')]]);
            }elseif($user->kyc_verified == 3){
                return redirect()->route('user.profile.index')->with(['error' => [__('Admin rejected your kyc information, Please re-submit again')]]);
            }
        }
        $amount = $request->amount;
        $user = auth()->user();
        $makePaymentCharge = TransactionSetting::where('slug','make-payment')->where('status',1)->first();
        $userWallet = UserWallet::where('user_id',$user->id)->first();
        if(!$userWallet){
            return back()->with(['error' => [__('User wallet not found')]]);
        }
        $baseCurrency = Currency::default();
        if(!$baseCurrency){
            return back()->with(['error' => [__('Default currency not found')]]);
        }
        $rate = $baseCurrency->rate;
        $receiver = Merchant::where('username', $request->username)->first();
        if(!$receiver){
            return back()->with(['error' => [__('Receiver not exist')]]);
        }
        $receiverWallet = MerchantWallet::where('merchant_id',$receiver->id)->first();
---
select * from `basic_settings` limit 1
select * from `admins` where `admins`.`id` in (1)
select * from `transaction_settings` where `slug` = 'make-payment' and `status` = 1 limit 1
select * from `user_wallets` where `user_id` = 2 limit 1
select * from `merchants` where `username` = 'testmerchant' limit 1
select * from `merchant_wallets` where `merchant_id` = 1 limit 1

    public function insertSender($trx_id,$user,$userWallet,$amount,$recipient,$payable,$receiver) {
        $trx_id = $trx_id;
        $authWallet = $userWallet;
        $afterCharge = ($authWallet->balance - $payable);
        $details =[
            'recipient_amount' => $recipient,
            'receiver' => $receiver,
        ];
        DB::beginTransaction();
        try{
            $id = DB::table("transactions")->insertGetId([
                'user_id'                       => $user->id,
                'user_wallet_id'                => $authWallet->id,
                'payment_gateway_currency_id'   => null,
                'type'                          => PaymentGatewayConst::TYPEMAKEPAYMENT,
                'trx_id'                        => $trx_id,
                'request_amount'                => $amount,
                'payable'                       => $payable,
                'available_balance'             => $afterCharge,
                'remark'                        => ucwords(remove_speacial_char(PaymentGatewayConst::TYPEMAKEPAYMENT," ")) . " To " .$receiver->fullname,
                'details'                       => json_encode($details),
                'attribute'                      =>PaymentGatewayConst::SEND,
                'status'                        => true,
                'created_at'                    => now(),
            ]);
            $this->updateSenderWalletBalance($authWallet,$afterCharge);
---
update `user_wallets` set `balance` = 939.44, `user_wallets`.`updated_at` = '2024-07-30 18:50:01' where `id` = 2

    public function insertSenderCharges($fixedCharge,$percent_charge, $total_charge, $amount,$user,$id,$receiver) {
        DB::beginTransaction();
        try{
            DB::table('transaction_charges')->insert([
                'transaction_id'    => $id,
                'percent_charge'    => $percent_charge,
                'fixed_charge'      =>$fixedCharge,
                'total_charge'      =>$total_charge,
                'created_at'        => now(),
            ]);
            DB::commit();

            //notification
            $notification_content = [
                'title'         =>__("Make Payment"),
                'message'       => __("Payment To ")." ".$receiver->fullname.' ' .$amount.' '.get_default_currency_code()." ".__("Successful"),
                'image'         => get_image($user->image,'user-profile'),
            ];

            UserNotification::create([
                'type'      => NotificationConst::MAKE_PAYMENT,
                'user_id'  => $user->id,
                'message'   => $notification_content,
            ]);
---
insert into `transaction_charges` (`transaction_id`, `percent_charge`, `fixed_charge`, `total_charge`, `created_at`) values (9, 0.15, 1, 1.15, '2024-07-30 18:50:01')
insert into `user_notifications` (`type`, `user_id`, `message`, `updated_at`, `created_at`) values ('MAKE-PAYMENT', 2, '{\"title\":\"Make Payment\",\"message\":\"Payment To  Test Merchant 15 USD Successful\",\"image\":\"http:\/\/localhost\/customization\/paywai\/public\/backend\/images\/default\/default.webp\"}', '2024-07-30 18:50:01', '2024-07-30 18:50:01')