app/Http/Controllers/User/RemitanceController.php

    public function getRecipientByTransType(Request $request){
        $receiver_country = $request->receiver_country;
        $transacion_type = $request->transacion_type;
          $data['recipient'] = Receipient::auth()->where('country', $receiver_country)->where('type',$transacion_type)->get();
---
select * from `receipients` where `user_id` = 18 and `country` = '1' and `type` = 'bank-transfer'