app/Http/Controllers/User/SendMoneyController.php

    public function insertSenderCharges($fixedCharge,$percent_charge, $total_charge, $amount,$user,$id,$receiver) {
        DB::beginTransaction();
        try{
            DB::table('transaction_charges')->insert([
                'transaction_id'    => $id,
                'percent_charge'    => $percent_charge,
                'fixed_charge'      =>$fixedCharge,
                'total_charge'      =>$total_charge,
                'created_at'        => now(),
            ]);
            DB::commit();

            //store notification
            $notification_content = [
                'title'         => __("Send Money"),
                'message'       => __('Transfer Money to')." ".$receiver->fullname.' ' .$amount.' '.get_default_currency_code()." ".__('Successful'),
                'image'         =>  get_image($user->image,'user-profile'),
            ];
            UserNotification::create([
                'type'      => NotificationConst::TRANSFER_MONEY,
                'user_id'  => $user->id,
                'message'   => $notification_content,
            ]);
---
insert into `transaction_charges` (`transaction_id`, `percent_charge`, `fixed_charge`, `total_charge`, `created_at`) values (5, 0.17, 1, 1.17, '2024-07-30 18:42:43')
insert into `user_notifications` (`type`, `user_id`, `message`, `updated_at`, `created_at`) values ('TRANSFER-MONEY', 2, '{\"title\":\"Send Money\",\"message\":\"Transfer Money to Test User 17 USD Successful\",\"image\":\"http:\/\/localhost\/customization\/paywai\/public\/backend\/images\/default\/default.webp\"}', '2024-07-30 18:42:43', '2024-07-30 18:42:43')


            //admin create notifications
            $notification_content['title'] = __('Transfer Money Send To').' ('.$receiver->username.')';
            AdminNotification::create([
                'type'      => NotificationConst::TRANSFER_MONEY,
                'admin_id'  => 1,
                'message'   => $notification_content,
            ]);
---
insert into `admin_notifications` (`type`, `admin_id`, `message`, `updated_at`, `created_at`) values ('TRANSFER-MONEY', 1, '{\"title\":\"Transfer Money Send To (appdevs)\",\"message\":\"Transfer Money to Test User 17 USD Successful\",\"image\":\"http:\/\/localhost\/customization\/paywai\/public\/backend\/images\/default\/default.webp\"}', '2024-07-30 18:42:43', '2024-07-30 18:42:43')

    public function insertReceiverCharges($fixedCharge,$percent_charge, $total_charge, $amount,$user,$id,$receiver) {
        DB::beginTransaction();
        try{
            DB::table('transaction_charges')->insert([
                'transaction_id'    => $id,
                'percent_charge'    => $percent_charge,
                'fixed_charge'      =>$fixedCharge,
                'total_charge'      =>$total_charge,
                'created_at'        => now(),
            ]);
            DB::commit();

            //store notification
            $notification_content = [
                'title'         => __("Send Money"),
                'message'       => __('Transfer Money from')." ".$user->fullname.' ' .$amount.' '.get_default_currency_code()." ".__('Successful'),
                'image'         => get_image($receiver->image,'user-profile'),
            ];
            UserNotification::create([
                'type'      => NotificationConst::TRANSFER_MONEY,
                'user_id'  => $receiver->id,
                'message'   => $notification_content,
            ]);
---
insert into `transaction_charges` (`transaction_id`, `percent_charge`, `fixed_charge`, `total_charge`, `created_at`) values (6, 0.17, 1, 1.17, '2024-07-30 18:42:44')
insert into `user_notifications` (`type`, `user_id`, `message`, `updated_at`, `created_at`) values ('TRANSFER-MONEY', 1, '{\"title\":\"Send Money\",\"message\":\"Transfer Money from Test User2 17 USD Successful\",\"image\":\"http:\/\/localhost\/customization\/paywai\/public\/backend\/images\/default\/default.webp\"}', '2024-07-30 18:42:44', '2024-07-30 18:42:44')


            //admin notification
            $notification_content['title'] = __('Transfer Money Received From').' ('.$user->username.')';
            AdminNotification::create([
                'type'      => NotificationConst::TRANSFER_MONEY,
                'admin_id'  => 1,
                'message'   => $notification_content,
            ]);
---
insert into `admin_notifications` (`type`, `admin_id`, `message`, `updated_at`, `created_at`) values ('TRANSFER-MONEY', 1, '{\"title\":\"Transfer Money Received From (testuser2)\",\"message\":\"Transfer Money from Test User2 17 USD Successful\",\"image\":\"http:\/\/localhost\/customization\/paywai\/public\/backend\/images\/default\/default.webp\"}', '2024-07-30 18:42:44', '2024-07-30 18:42:44')