app/Http/Controllers/User/SendMoneyController.php

select * from `transaction_settings` where `slug` = 'transfer' and `status` = 1 limit 1
select * from `transactions` where `user_id` = 1 and `type` = 'TRANSFER-MONEY' order by `created_at` desc limit 10
---
    public function index() {
        $page_title         = __("Send Money");
        $sendMoneyCharge    = TransactionSetting::where('slug','transfer')->where('status',1)->first();
        $transactions       = Transaction::auth()->senMoney()->latest()->take(10)->get();

select * from `users` where `username` = 'testuser2' limit 1
---
    public function checkUser(Request $request){
        $username = $request->username;
        $exist['data'] = User::where('username',$username)->first();

select * from `basic_settings` limit 1
select * from `admins` where `admins`.`id` in (1)
select * from `transaction_settings` where `slug` = 'transfer' and `status` = 1 limit 1
select * from `user_wallets` where `user_id` = 1 limit 1
select * from `users` where `username` = 'testuser2' limit 1
select * from `user_wallets` where `user_id` = 2 limit 1
---
    public function confirmed(Request $request){
        $request->validate([
            'amount' => 'required|numeric|gt:0',
            'username' => 'required'
        ]);
        $basic_setting = BasicSettings::first();
        $user = auth()->user();
        if($basic_setting->kyc_verification){
            if( $user->kyc_verified == 0){
                return redirect()->route('user.profile.index')->with(['error' => [__('Please submit kyc information!')]]);
            }elseif($user->kyc_verified == 2){
                return redirect()->route('user.profile.index')->with(['error' => [__('Please wait before admin approves your kyc information')]]);
            }elseif($user->kyc_verified == 3){
                return redirect()->route('user.profile.index')->with(['error' => [__('Admin rejected your kyc information, Please re-submit again')]]);
            }
        }
        $amount = $request->amount;
        $user = auth()->user();
        $sendMoneyCharge = TransactionSetting::where('slug','transfer')->where('status',1)->first();
        $userWallet = UserWallet::where('user_id',$user->id)->first();
        if(!$userWallet){
            return back()->with(['error' => [__('User wallet not found')]]);
        }

        $baseCurrency = Currency::default();
        $rate = $baseCurrency->rate;
        if(!$baseCurrency){
            return back()->with(['error' => [__('Default currency not found')]]);
        }
        $receiver = User::where('username',$request->username)->first();
        if(!$receiver){
            return back()->with(['error' => [__('Receiver not exist')]]);
        }
        $receiverWallet = UserWallet::where('user_id',$receiver->id)->first();

update `user_wallets` set `balance` = 936.42, `user_wallets`.`updated_at` = '2024-07-31 16:30:40' where `id` = 1
---
    public function insertSender($trx_id,$user,$userWallet,$amount,$recipient,$payable,$receiver) {
        $trx_id = $trx_id;
        $authWallet = $userWallet;
        $afterCharge = ($authWallet->balance - $payable);
        $details =[
            'recipient_amount' => $recipient,
            'receiver' => $receiver,
        ];
        DB::beginTransaction();
        try{
            $id = DB::table("transactions")->insertGetId([
                'user_id'                       => $user->id,
                'user_wallet_id'                => $authWallet->id,
                'payment_gateway_currency_id'   => null,
                'type'                          => PaymentGatewayConst::TYPETRANSFERMONEY,
                'trx_id'                        => $trx_id,
                'request_amount'                => $amount,
                'payable'                       => $payable,
                'available_balance'             => $afterCharge,
                'remark'                        => ucwords(remove_speacial_char(PaymentGatewayConst::TYPETRANSFERMONEY," ")) . " To " .$receiver->fullname,
                'details'                       => json_encode($details),
                'attribute'                      =>PaymentGatewayConst::SEND,
                'status'                        => true,
                'created_at'                    => now(),
            ]);
            $this->updateSenderWalletBalance($authWallet,$afterCharge);

insert into `transaction_charges` (`transaction_id`, `percent_charge`, `fixed_charge`, `total_charge`, `created_at`) values (14, 0.15, 1, 1.15, '2024-07-31 16:30:40')
insert into `user_notifications` (`type`, `user_id`, `message`, `updated_at`, `created_at`) values ('TRANSFER-MONEY', 1, '{\"title\":\"Send Money\",\"message\":\"Transfer Money to Test User2 15 USD Successful\",\"image\":\"http:\/\/localhost\/customization\/paywai\/public\/backend\/images\/default\/default.webp\"}', '2024-07-31 16:30:40', '2024-07-31 16:30:40')
---
    public function insertSenderCharges($fixedCharge,$percent_charge, $total_charge, $amount,$user,$id,$receiver) {
        DB::beginTransaction();
        try{
            DB::table('transaction_charges')->insert([
                'transaction_id'    => $id,
                'percent_charge'    => $percent_charge,
                'fixed_charge'      => $fixedCharge,
                'total_charge'      => $total_charge,
                'created_at'        => now(),
            ]);
            DB::commit();

            //store notification
            $notification_content = [
                'title'         => __("Send Money"),
                'message'       => __('Transfer Money to')." ".$receiver->fullname.' ' .$amount.' '.get_default_currency_code()." ".__('Successful'),
                'image'         =>  get_image($user->image,'user-profile'),
            ];
            UserNotification::create([
                'type'      => NotificationConst::TRANSFER_MONEY,
                'user_id'  => $user->id,
                'message'   => $notification_content,
            ]);

insert into `admin_notifications` (`type`, `admin_id`, `message`, `updated_at`, `created_at`) values ('TRANSFER-MONEY', 1, '{\"title\":\"Transfer Money Send To (testuser2)\",\"message\":\"Transfer Money to Test User2 15 USD Successful\",\"image\":\"http:\/\/localhost\/customization\/paywai\/public\/backend\/images\/default\/default.webp\"}', '2024-07-31 16:30:44', '2024-07-31 16:30:44')
---

            //admin create notifications
            $notification_content['title'] = __('Transfer Money Send To').' ('.$receiver->username.')';
            AdminNotification::create([
                'type'      => NotificationConst::TRANSFER_MONEY,
                'admin_id'  => 1,
                'message'   => $notification_content,
            ]);

update `user_wallets` set `balance` = 1009.82, `user_wallets`.`updated_at` = '2024-07-30 18:42:44' where `id` = 1
---
    public function insertReceiver($trx_id,$user,$userWallet,$amount,$recipient,$payable,$receiver,$receiverWallet) {
        $trx_id = $trx_id;
        $receiverWallet = $receiverWallet;
        $recipient_amount = ($receiverWallet->balance + $recipient);
        $details =[
            'sender_amount' => $amount,
            'sender' => $user,
        ];
        DB::beginTransaction();
        try{
            $id = DB::table("transactions")->insertGetId([
                'user_id'                       => $receiver->id,
                'user_wallet_id'                => $receiverWallet->id,
                'payment_gateway_currency_id'   => null,
                'type'                          => PaymentGatewayConst::TYPETRANSFERMONEY,
                'trx_id'                        => $trx_id,
                'request_amount'                => $amount,
                'payable'                       => $payable,
                'available_balance'             => $recipient_amount,
                'remark'                        => ucwords(remove_speacial_char(PaymentGatewayConst::TYPETRANSFERMONEY," ")) . " From " .$user->fullname,
                'details'                       => json_encode($details),
                'attribute'                      =>PaymentGatewayConst::RECEIVED,
                'status'                        => true,
                'created_at'                    => now(),
            ]);
            $this->updateReceiverWalletBalance($receiverWallet,$recipient_amount);

update `user_wallets` set `balance` = 1025, `user_wallets`.`updated_at` = '2024-07-31 16:31:25' where `id` = 2
---
    public function updateReceiverWalletBalance($receiverWallet,$recipient_amount) {
        $receiverWallet->update([
            'balance'   => $recipient_amount,
        ]);

insert into `transaction_charges` (`transaction_id`, `percent_charge`, `fixed_charge`, `total_charge`, `created_at`) values (15, 0.15, 1, 1.15, '2024-07-31 16:31:25')
insert into `user_notifications` (`type`, `user_id`, `message`, `updated_at`, `created_at`) values ('TRANSFER-MONEY', 2, '{\"title\":\"Send Money\",\"message\":\"Transfer Money from Test User 15 USD Successful\",\"image\":\"http:\/\/localhost\/customization\/paywai\/public\/backend\/images\/default\/default.webp\"}', '2024-07-31 16:31:25', '2024-07-31 16:31:25')
---
    public function insertReceiverCharges($fixedCharge,$percent_charge, $total_charge, $amount,$user,$id,$receiver) {
        DB::beginTransaction();
        try{
            DB::table('transaction_charges')->insert([
                'transaction_id'    => $id,
                'percent_charge'    => $percent_charge,
                'fixed_charge'      =>$fixedCharge,
                'total_charge'      =>$total_charge,
                'created_at'        => now(),
            ]);
            DB::commit();

            //store notification
            $notification_content = [
                'title'         => __("Send Money"),
                'message'       => __('Transfer Money from')." ".$user->fullname.' ' .$amount.' '.get_default_currency_code()." ".__('Successful'),
                'image'         => get_image($receiver->image,'user-profile'),
            ];
            UserNotification::create([
                'type'      => NotificationConst::TRANSFER_MONEY,
                'user_id'  => $receiver->id,
                'message'   => $notification_content,
            ]);

insert into `admin_notifications` (`type`, `admin_id`, `message`, `updated_at`, `created_at`) values ('TRANSFER-MONEY', 1, '{\"title\":\"Transfer Money Received From (appdevs)\",\"message\":\"Transfer Money from Test User 15 USD Successful\",\"image\":\"http:\/\/localhost\/customization\/paywai\/public\/backend\/images\/default\/default.webp\"}', '2024-07-31 16:31:32', '2024-07-31 16:31:32')
---

            //admin notification
            $notification_content['title'] = __('Transfer Money Received From').' ('.$user->username.')';
            AdminNotification::create([
                'type'      => NotificationConst::TRANSFER_MONEY,
                'admin_id'  => 1,
                'message'   => $notification_content,
            ]);