app/Http/Helpers/helpers.php

select * from `admin_notifications` where `admin_id` = 1 and `clear_at` is null order by `created_at` desc
---
function get_admin_notifications()
{
    $notifications = AdminNotification::auth()->where('clear_at',null)->latest()->get();

select * from `user_notifications` where `user_id` = 2 order by `created_at` desc limit 5
select * from `merchant_notifications` where `merchant_id` = 10 order by `created_at` desc limit 5
select * from `agent_notifications` where `agent_id` = 1 order by `created_at` desc limit 5
---
function get_user_notifications()
{
    if(auth()->guard('web')->check()){
        $notifications = UserNotification::auth()->latest()->take(5)->get();
    } else if(auth()->guard('merchant')->check()){
        $notifications = MerchantNotification::auth()->latest()->take(5)->get();
    }else if(auth()->guard('agent')->check()){
        $notifications = AgentNotification::auth()->latest()->take(5)->get();

select * from `languages` where `status` = 1 limit 1
---
function selectedLang(){
    $default_language = Language::where('status',GlobalConst::ACTIVE)->first();

select * from `languages` where `status` = 1 limit 1
---
function selectedLangDir(){
    if(session()->get('local')){
    $default_language = Language::where('code',session()->get('local'))->first();
    $default_language_dir = $default_language->dir ?? LanguageConst::NOT_REMOVABLE;
    }else{
        $default_language = Language::where('status',GlobalConst::ACTIVE)->first();

select * from `user_wallets` where `user_id` = 2 limit 1
select * from `merchant_wallets` where `merchant_id` = 10 limit 1
select * from `agent_wallets` where `agent_id` = 1 limit 1
---
function authWalletBalance(){
    if(auth()->guard('web')->check()){
        $wallet = UserWallet::where('user_id',auth()->user()->id)->first();
        return number_format($wallet->balance,2);
    }else if(auth()->guard('merchant')->check()){
        $wallet = MerchantWallet::where('merchant_id',auth()->user()->id)->first();
        return number_format($wallet->balance,2);
    }else if(auth()->guard('agent')->check()){

        $wallet = AgentWallet::where('agent_id',auth()->user()->id)->first();

select * from `module_settings` where `slug` = 'agent-money-in' limit 1
---
function module_access($key,$module = null)
{
    if (!$module) {
        $module = ModuleSetting::query();
    }
    return $module->where('slug',$key)->first();

select * from `virtual_card_apis` limit 1
---
function virtual_card_system($name)
{
    $method = VirtualCardApi::first();

select count(*) as aggregate from `sudo_virtual_cards` where `user_id` = 1
select count(*) as aggregate from `sudo_virtual_cards` where `user_id` = 1 and `status` = 1
select count(*) as aggregate from `sudo_virtual_cards` where `user_id` = 1 and `status` = 0
select sum(`amount`) as aggregate from `sudo_virtual_cards` where `user_id` = 1 and `status` = 1
---
 function userActiveCardData(){
    if(virtual_card_system('flutterwave') == "flutterwave"){
        $virtual_cards = VirtualCard::where('user_id',auth()->user()->id)->count();
        $active_cards =  VirtualCard::where('user_id',auth()->user()->id)->where('is_active',1)->count();
        $inactive_cards = VirtualCard::where('user_id',auth()->user()->id)->where('is_active',0)->count();
        $total_balance = VirtualCard::where('user_id',auth()->user()->id)->where('is_active',1)->sum('amount');
    }elseif(virtual_card_system('sudo') == "sudo"){
        $virtual_cards = SudoVirtualCard::where('user_id',auth()->user()->id)->count();
        $active_cards =  SudoVirtualCard::where('user_id',auth()->user()->id)->where('status',1)->count();
        $inactive_cards = SudoVirtualCard::where('user_id',auth()->user()->id)->where('status',0)->count();
        $total_balance = SudoVirtualCard::where('user_id',auth()->user()->id)->where('status',1)->sum('amount');