app/Http/Controllers/Merchant/Auth/ForgotPasswordController.php

select * from `merchants` where `full_mobile` = 'merchant@appdevs.net' or `email` = 'merchant@appdevs.net' limit 1
---
    public function sendCode(Request $request)
    {
        $request->validate([
            'credentials'   => "required|string|max:100",
        ]);

        $user = Merchant::orWhere('full_mobile',$request->credentials)
                ->orWhere('email',$request->credentials)->first();

delete from `merchant_password_resets` where `merchant_id` = 1
insert into `merchant_password_resets` (`merchant_id`, `email`, `token`, `code`, `updated_at`, `created_at`) values (1, 'merchant@appdevs.net', 'jMdG9UUFVDvqU3DGBPXtKaNsXfAzkV14pUagEAoXRQdyeyUc95syy3Fs6ctaQnefNgvOnjuBzZhEsTYD', '496396', '2024-07-25 15:05:14', '2024-07-25 15:05:14')
---
            $code = generate_random_code();

            try{
                MerchantPasswordReset::where("merchant_id",$user->id)->delete();
                $password_reset = MerchantPasswordReset::create([
                    'merchant_id'   => $user->id,
                    'email'         => $request->credentials,
                    'token'         => $token,
                    'code'          => $code,
                ]);

select * from `merchant_password_resets` where `token` = 'RcewQtkOjcdB333JMAheH6up4iPUHXPCEw6QxTpN9Z6JBPpEVvO7DD42Qr4GR28xMqVybEzn4SpecHkU' limit 1
---
    public function verifyCode(Request $request,$token)
    {
        $request->merge(['token' => $token]);
        $validated = Validator::make($request->all(),[
            'token'     => "required|string|exists:merchant_password_resets,token",
            'code'      => "required|array",
            'code.*'    => "required|numeric",
        ])->validate();
        $code = $request->code;
        $code = implode("",$code);

        $basic_settings = BasicSettingsProvider::get();
        $otp_exp_seconds = $basic_settings->merchant_otp_exp_seconds ?? 0;

        $password_reset = MerchantPasswordReset::where("token",$token)->first();