app/Http/Controllers/Merchant/Auth/RegisterController.php

select * from `users` where `full_mobile` = '33333333311' limit 1
select * from `agents` where `full_mobile` = '33333333311' limit 1
select * from `merchants` where `full_mobile` = '33333333311' limit 1
---
    public function sendVerifyCode(Request $request){
        $basic_settings = $this->basic_settings;
        if($basic_settings->merchant_agree_policy){
            $agree = 'required';
        }else{
            $agree = '';
        }

        $validator = Validator::make($request->all(),[
            'register_type' => 'required|in:'.global_const()::PHONE.','.global_const()::EMAIL,
            'credentials' => ['required', function ($attribute, $value, $fail) use ($request) {
                if ($request->register_type == global_const()::PHONE && !preg_match('/^[0-9]{10,15}$/', $value)) {
                    $fail('The ' . $attribute . ' must be a valid phone number.');
                }
                if ($request->register_type == global_const()::EMAIL && !filter_var($value, FILTER_VALIDATE_EMAIL)) {
                    $fail('The ' . $attribute . ' must be a valid email address.');
                }
            }],
            'agree'                 =>  $agree,

        ]);
        $validated = $validator->validate();
        if($validated['register_type'] == GlobalConst::PHONE){
            $exist              = User::where('full_mobile',$validated['credentials'])->first();
            $exists_agent       = Agent::where('full_mobile',$validated['credentials'])->first();
            $exists_merchant    = Merchant::where('full_mobile',$validated['credentials'])->first();

select * from `users` where `email` = 'merchant6@appdevs.net' limit 1
select * from `agents` where `email` = 'merchant6@appdevs.net' limit 1
select * from `merchants` where `email` = 'merchant6@appdevs.net' limit 1
---
            };
            return redirect()->route('merchant.sms.verify',$data['token'])->with(['success' => [__('Verification code sended to your phone number.')]]);
        }else{
            $exist              = User::where('email',$validated['credentials'])->first();
            $exists_agent       = Agent::where('email',$validated['credentials'])->first();
            $exists_merchant    = Merchant::where('email',$validated['credentials'])->first();

select exists(select * from `users` where `username` = 'dfsfsdf') as `exists`
select exists(select * from `agents` where `username` = 'dfsfsdf') as `exists`
select exists(select * from `merchants` where `username` = 'dfsfsdf') as `exists`
---
    public function register(Request $request)
    {
        $basic_settings             = $this->basic_settings;

        $validated = $this->validator($request->all())->validate();
        if($basic_settings->merchant_kyc_verification == true){
            $user_kyc_fields = SetupKyc::merchantKyc()->first()->fields ?? [];
            $validation_rules = $this->generateValidationRules($user_kyc_fields);
            $kyc_validated = Validator::make($request->all(),$validation_rules)->validate();
            $get_values = $this->registerPlaceValueWithFields($user_kyc_fields,$kyc_validated);
        }else{
            $get_values     = [];
        }


        $register_data      = session()->get('register_data');

        if($register_data != null && $register_data['sms_verified'] == true){
            if(User::where('username',$validated['username'])->exists()){
                throw ValidationException::withMessages([
                    'username' => _("The username has already been taken.")
                ]);
            }
            if(Agent::where('username',$validated['username'])->exists()){
                throw ValidationException::withMessages([
                    'username' => _("The username has already been taken.")
                ]);
            }
            if(Merchant::where('username',$validated['username'])->exists()){

select exists(select * from `users` where `full_mobile` = '1777777112') as `exists`
---
            $validated['mobile']        = remove_speacial_char($validated['phone']);
            $complete_phone             = $validated['mobile'];

            if(User::where('full_mobile',$complete_phone)->exists()) {

select exists(select * from `agents` where `full_mobile` = '1777777112') as `exists`
---
                    'phone'     => __('Phone number is already exists'),
                ]);
            }
            if(Agent::where('full_mobile',$complete_phone)->exists()) {

select exists(select * from `merchants` where `full_mobile` = '1777777112') as `exists`
---
                    'phone'     => __('Phone number is already exists in agent.'),
                ]);
            }
            if(Merchant::where('full_mobile',$complete_phone)->exists()) {

select exists(select * from `merchants` where `email` = 'agent@appdevs.net') as `exists`
---
            if($validated['email'] != '' || $validated['email'] != null){
                $exist = Merchant::where('email',$validated['email'])->first();

                if($exist) return back()->with(['error' => [__('Merchant already  exists, please try with another email.')]]);