app/Http/Controllers/Api/Merchant/AuthorizationController.php

insert into `merchants` (`firstname`, `lastname`, `business_name`, `email`, `mobile`, `full_mobile`, `password`, `username`, `address`, `status`, `email_verified`, `sms_verified`, `kyc_verified`, `updated_at`, `created_at`) values ('merchant', 'akash', 'Hello Rabbi', 'merchant10@gmail.com', '1111114444444', '1111114444444', '$2y$10$V2Y/LzzuWBHmpIfCIWyVR.aFpHzy.i6gRDYQb4M8tQJC.qNmuYwC6', 'rabbi_king', '{\"address\":\"\",\"city\":\"Dhaka\",\"zip\":\"7890\",\"country\":\"Bangladesh\",\"state\":\"\"}', 1, 1, 1, 1, '2024-07-25 16:26:13', '2024-07-25 16:26:13')
---
                    $token->delete();
                }
            }
            DB::table("merchant_authorizations")->insert($data);