app/Http/Controllers/Api/Merchant/AuthorizationController.php

    public function verifySmsOtp(Request $request){

        $validator = Validator::make($request->all(), [
            'phone'         => 'required|string|max:20',
            'code'          => "required|max:6",
        ]);
        if($validator->fails()){
            $error =  ['error'=>$validator->errors()->all()];
            return Helpers::validation($error);
        }
        $user = auth()->user();
        $code = $request->code;
        $otp_exp_sec = BasicSettingsProvider::get()->merchant_otp_exp_seconds ?? GlobalConst::DEFAULT_TOKEN_EXP_SEC;
        $auth_column = MerchantAuthorization::where("phone",$request->phone)->first();
        if(!$auth_column){
            $message = ['error'=>[__('Invalied request')]];
            return Helpers::error($message);
        }
        if( $auth_column->code != $code){
            $message = ['error'=>[__('The verification code does not match')]];
            return Helpers::error($message);
        }
        if($auth_column->created_at->addSeconds($otp_exp_sec) < now()) {
            $auth_column->delete();
            $message = ['error'=>[__('Verification code is expired')]];
            return Helpers::error($message);
        }
        try{
            $auth_column->delete();
---
select * from `merchant_authorizations` where `phone` = '2123146545645' limit 1
delete from `merchant_authorizations` where `id` = 23