app/Http/Controllers/Api/Merchant/AuthorizationController.php

        ];
        DB::beginTransaction();
        try{
            $oldToken = MerchantAuthorization::where("phone",$validated['phone'])->get();
---
select * from `merchant_authorizations` where `phone` = '17777777778'


        $code = $request->code;
        $otp_exp_sec = BasicSettingsProvider::get()->merchant_otp_exp_seconds ?? GlobalConst::DEFAULT_TOKEN_EXP_SEC;
        $auth_column = MerchantAuthorization::where("email",$request->email)->first();
---
select * from `merchant_authorizations` where `email` = 'merchant10@gmail.com' limit 1

            $complete_phone             = $mobile;
            $userName                   = $data['username'];

            $check_user_name = User::where('username',$userName)->first();
---
select * from `users` where `username` = 'rabbi_king' limit 1

                $error = ['error'=>[__('Username already exist')]];
                return Helpers::validation($error);
            }
            $check_user_name_agent = Agent::where('username',$userName)->first();
---
select * from `agents` where `username` = 'rabbi_king' limit 1

                $error = ['error'=>[__('Username already exist')]];
                return Helpers::validation($error);
            }
            $check_user_name_merchant = Merchant::where('username',$userName)->first();
---
select * from `merchants` where `username` = 'rabbi_king' limit 1

        }
        $code = $request->code;
        $otp_exp_sec = BasicSettingsProvider::get()->merchant_otp_exp_seconds ?? GlobalConst::DEFAULT_TOKEN_EXP_SEC;
        $auth_column = MerchantAuthorization::where("phone",$request->phone)->first();
---
select * from `merchant_authorizations` where `phone` = '74102589' limit 1