app/Http/Controllers/Merchant/MoneyOutController.php

select * from `merchant_wallets` where `merchant_id` = 10
select * from `payment_gateway_currencies` where exists (select * from `payment_gateways` where `payment_gateway_currencies`.`payment_gateway_id` = `payment_gateways`.`id` and `slug` = 'money-out' and `status` = 1)
select * from `transactions` where `merchant_id` = 10 and `type` = 'MONEY-OUT' order by `id` desc, `created_at` desc limit 10
---
    public function index()
    {
        $page_title = __("Withdraw Money");
        $user_wallets = MerchantWallet::auth()->get();
        $user_currencies = Currency::whereIn('id',$user_wallets->pluck('id')->toArray())->get();

        $payment_gateways = PaymentGatewayCurrency::whereHas('gateway', function ($gateway) {
            $gateway->where('slug', PaymentGatewayConst::money_out_slug());
            $gateway->where('status', 1);
        })->get();
        $transactions = Transaction::merchantAuth()->moneyOut()->orderByDesc("id")->latest()->take(10)->get();