app/Http/Controllers/Api/Merchant/Auth/LoginController.php

select * from `merchants` where `full_mobile` = 'merchant@appdevs.net' or `email` = 'merchant@appdevs.net' limit 1
---
    public function login(Request $request){
        $validator      = Validator::make($request->all(), [
            'phone'     => 'required|max:50',
            'password'  => 'required|min:6',
        ]);
        if($validator->fails()){
            $error =  ['error'=>$validator->errors()->all()];
            return ApiHelpers::validation($error);
        }
        $user = Merchant::orWhere('full_mobile',$request->phone)
                ->orWhere('email',$request->phone)->first();

select * from `users` where `username` = 'merchan444' limit 1
---

        $data                       = $request->all();
        $userName = $data['username'];
        $check_user_name = User::where('username',$userName)->first();

select * from `agents` where `username` = 'merchan444' limit 1
---
            $error = ['error'=>[__('Username already exist')]];
            return ApiHelpers::validation($error);
        }
        $check_user_name_agent = Agent::where('username',$userName)->first();

select * from `merchants` where `username` = 'merchan444' limit 1
---
            $error = ['error'=>[__('Username already exist')]];
            return ApiHelpers::validation($error);
        }
        $check_user_name_merchant = Merchant::where('username',$userName)->first();

select * from `users` where `full_mobile` = '333333333' limit 1
select * from `agents` where `full_mobile` = '333333333' limit 1
select * from `merchants` where `full_mobile` = '333333333' limit 1
---
        if(($request->type == 'phone' && $request->phone != '') || ($request->type == 'phone' && $request->phone != null)){
            $data['mobile']             = remove_speacial_char($data['phone']);
            $complete_phone             = $data['mobile'];
            $mobile_validate            = User::where('full_mobile',$complete_phone)->first();
            $mobile_validate_agent      = Agent::where('full_mobile',$complete_phone)->first();
            $mobile_validate_merchant   = Merchant::where('full_mobile',$complete_phone)->first();

select * from `users` where `email` = 'mer2@gmail.com' limit 1
select * from `agents` where `email` = 'mer2@gmail.com' limit 1
select * from `merchants` where `email` = 'mer2@gmail.com' limit 1
---
            }
            $data['full_mobile']       = $complete_phone;
            if($data['email'] != '' || $data['email'] != null){
                $email_validate            = User::where('email',$data['email'])->first();
                $email_validate_agent      = Agent::where('email',$data['email'])->first();
                $email_validate_merchant   = Merchant::where('email',$data['email'])->first();

select * from `merchant_authorizations` where `email` = 'mer2@gmail.com'
---
                ];
                DB::beginTransaction();
                try{
                    $oldToken = MerchantAuthorization::where("email",$data['email'])->get();

insert into `merchants` (`firstname`, `lastname`, `business_name`, `email`, `mobile`, `full_mobile`, `password`, `username`, `address`, `status`, `email_verified`, `sms_verified`, `kyc_verified`, `updated_at`, `created_at`) values ('Ayon', 'Islam', 'Hello Company', 'merchant15@gmail.com', '7410000000', '7410000000', '$2y$10$UxQPw3.HuJQXHSXYDhXhXuN0qXSo59FOOIxYOYg3Hb1xix7dpv196', 'merchan787', '{\"address\":\"\",\"city\":\"Dhaka\",\"zip\":\"1230\",\"country\":\"Bangladesh\",\"state\":\"\"}', 1, 0, 1, 0, '2024-07-27 15:10:52', '2024-07-27 15:10:52')
---
                            $token->delete();
                        }
                    }
                    DB::table("merchant_authorizations")->insert($token_data);

insert into `merchants` (`firstname`, `lastname`, `business_name`, `email`, `mobile`, `full_mobile`, `password`, `username`, `address`, `status`, `email_verified`, `sms_verified`, `kyc_verified`, `updated_at`, `created_at`) values ('Ayon', 'Islam', 'Hello Company', 'mer2@gmail.com', '17777777774', '17777777774', '$2y$10$NrfGFqQyrUsR5zRgqeAVs.lELdD.MmjFLLgFPHdC1SJZtRuCJD71W', 'ytyghjghjgh', '{\"address\":\"\",\"city\":\"Dhaka\",\"zip\":\"1230\",\"country\":\"Bangladesh\",\"state\":\"\"}', 1, 0, 1, 1, '2024-07-29 10:07:50', '2024-07-29 10:07:50')
---
                $user->email_verified       = false;
                $user->sms_verified         = true;
                $user->kyc_verified         = ($basic_settings->merchant_kyc_verification == true) ? false : true;
                $user->save();

insert into `merchants` (`firstname`, `lastname`, `business_name`, `email`, `mobile`, `full_mobile`, `password`, `username`, `address`, `status`, `email_verified`, `sms_verified`, `kyc_verified`, `updated_at`, `created_at`) values ('Ayon', 'Islam', 'Hello Company', '', '1111114444444', '1111114444444', '$2y$10$rYbPNfnh.1Y0VoPn9QPONeGW6bdSSYic3NTdQMXBXry/C0CykJQ8O', 'merchant56', '{\"address\":\"\",\"city\":\"Dhaka\",\"zip\":\"1230\",\"country\":\"Bangladesh\",\"state\":\"\"}', 1, 1, 1, 1, '2024-07-25 16:15:40', '2024-07-25 16:15:40')
---
                }
                $token = $user->createToken('merchant_token')->accessToken;
                $this->createUserWallets($user);
                $this->createDeveloperApiReg($user);

insert into `merchants` (`firstname`, `lastname`, `business_name`, `email`, `mobile`, `full_mobile`, `password`, `username`, `address`, `status`, `email_verified`, `sms_verified`, `kyc_verified`, `updated_at`, `created_at`) values ('Ayon', 'Islam', 'Hello Company', '', '333333333', '333333333', '$2y$10$DcQpP3c5U99vcybQY3P/5u/ljGycVBU8j8eZP8yA9WYaNt6EsCME2', 'merchan444', '{\"address\":\"\",\"city\":\"Dhaka\",\"zip\":\"1230\",\"country\":\"Bangladesh\",\"state\":\"\"}', 1, 0, 1, 1, '2024-08-09 16:02:01', '2024-08-09 16:02:01')
---
                $user->email_verified       = false;
                $user->sms_verified         = true;
                $user->kyc_verified         = ($basic_settings->merchant_kyc_verification == true) ? false : true;
                $user->save();

insert into `merchants` (`firstname`, `lastname`, `business_name`, `email`, `mobile`, `full_mobile`, `password`, `username`, `address`, `status`, `email_verified`, `sms_verified`, `kyc_verified`, `updated_at`, `created_at`) values ('Ayon', 'Islam', 'Hello Company', '', '17777777778', '17777777778', '$2y$10$U1WYkdBKjZawET/7PPoX1uflfvAvOn9PTfOoaUtdTn1ANRKRw2e3.', 'tetsgg', '{\"address\":\"\",\"city\":\"Dhaka\",\"zip\":\"1230\",\"country\":\"Bangladesh\",\"state\":\"\"}', 1, 1, 0, 1, '2024-07-29 09:57:48', '2024-07-29 09:57:48')
---
                    }

                }
                $token = $user->createToken('merchant_token')->accessToken;

select * from `merchant_qr_codes` where `merchant_qr_codes`.`merchant_id` = 15 and `merchant_qr_codes`.`merchant_id` is not null limit 1
insert into `merchant_qr_codes` (`merchant_id`, `slug`, `qr_code`, `updated_at`, `created_at`) values (15, '\"8e89225f-b9e1-45ce-8440-4ace15bf827c\"', '{\"receiver_type\":\"Merchant\",\"username\":\"merchan444\",\"amount\":null}', '2024-08-09 16:02:02', '2024-08-09 16:02:02')
---
    public function createQr($user){
		$user = $user;
	    $qrCode = $user->qrCode()->first();
        $in['merchant_id'] = $user->id;
        $in['slug'] 		= Str::uuid();
        $data 				= [
			'receiver_type' => 'Merchant',
			'username'		=> $user->username,
			'amount'		=> null,
		];
        $in['qr_code'] =  $data;
	    if(!$qrCode){
            MerchantQrCode::create($in);