app/Http/Controllers/Api/Merchant/Auth/LoginController.php


        if($data['type'] == 'phone'){
            if($data['email'] != '' || $data['email'] != null){
                $email = Merchant::where('email',$data['email'])->first();
---
select * from `merchants` where `email` = 'merchant15@gmail.com' limit 1

                    ];
                    DB::beginTransaction();
                    try{
                        $oldToken = MerchantAuthorization::where("email",$data['email'])->get();
---
select * from `merchant_authorizations` where `email` = 'merchant15@gmail.com'

                        return ApiHelpers::error($message);
                    };
                    $userName = $data['username'];
                    $check_user_name = User::where('username',$userName)->first();
---
select * from `users` where `username` = 'merchan787' limit 1

                        $error = ['error'=>[__('Username already exist')]];
                        return ApiHelpers::validation($error);
                    }
                    $check_user_name_agent = Agent::where('username',$userName)->first();
---
select * from `agents` where `username` = 'merchan787' limit 1

                        $error = ['error'=>[__('Username already exist')]];
                        return ApiHelpers::validation($error);
                    }
                    $check_user_name_merchant = Merchant::where('username',$userName)->first();
---
select * from `merchants` where `username` = 'merchan787' limit 1

                        DB::beginTransaction();
                        try{
                            DB::table('merchant_kyc_data')->updateOrInsert(["merchant_id" => $user->id],$create);
                            $user->update([
                                'kyc_verified'  => GlobalConst::PENDING,
                            ]);
---
update `merchants` set `kyc_verified` = 2, `merchants`.`updated_at` = '2024-07-27 15:10:52' where `id` = 12

    public function createQr($user){
		$user = $user;
	    $qrCode = $user->qrCode()->first();
        $in['merchant_id'] = $user->id;
        $in['slug'] 		= Str::uuid();
        $data 				= [
			'receiver_type' => 'Merchant',
			'username'		=> $user->username,
			'amount'		=> null,
		];
        $in['qr_code'] =  $data;
	    if(!$qrCode){
            MerchantQrCode::create($in);
---
select * from `merchant_qr_codes` where `merchant_qr_codes`.`merchant_id` = 12 and `merchant_qr_codes`.`merchant_id` is not null limit 1
insert into `merchant_qr_codes` (`merchant_id`, `slug`, `qr_code`, `updated_at`, `created_at`) values (12, '\"4964a1d1-c1f4-4941-bc9b-7e179d264d00\"', '{\"receiver_type\":\"Merchant\",\"username\":\"merchan787\",\"amount\":null}', '2024-07-27 15:10:52', '2024-07-27 15:10:52')