app/Http/Controllers/User/Auth/ForgotPasswordController.php

    public function verifyCode(Request $request,$token)
    {
        $request->merge(['token' => $token]);
        $validated = Validator::make($request->all(),[
            'token'         => "required|string|exists:user_password_resets,token",
            'code'      => "required|array",
            'code.*'    => "required|numeric",
        ])->validate();
        $code = $request->code;
        $code = implode("",$code);

        $basic_settings = BasicSettingsProvider::get();
        $otp_exp_seconds = $basic_settings->otp_exp_seconds ?? 0;

        $password_reset = UserPasswordReset::where("token",$token)->first();
---
select * from `user_password_resets` where `token` = 'zdPiQCAJUX6Dqe2y7NG8P73zq64M38QKfaQ7HjNoP7FcFgdhxViA7BNpU5iVtS9kzWYtEXDJM93g2MPg' limit 1

    public function resetPassword(Request $request,$token) {
        $basic_settings = BasicSettingsProvider::get();
        $passowrd_rule = "required|string|min:6|confirmed";
        if($basic_settings->secure_password) {
            $passowrd_rule = ["required",Password::min(8)->letters()->mixedCase()->numbers()->symbols()->uncompromised(),"confirmed"];
        }

        $request->merge(['token' => $token]);
        $validated = Validator::make($request->all(),[
            'token'         => "required|string|exists:user_password_resets,token",
            'password'      => $passowrd_rule,
        ])->validate();

        $password_reset = UserPasswordReset::where("token",$token)->first();
        if(!$password_reset) {
            throw ValidationException::withMessages([
                'password'      => __('Password Reset Token Expired'),
            ]);
        }

        try{
            $password_reset->user->update([
                'password'      => Hash::make($validated['password']),
            ]);
---
select * from `user_password_resets` where `token` = 'mHwsSiBVYk2gbmk91tUCzYZUyqtXpTqKlWXG8GAYNjQN22hr7HbH8JqMgUCumm1UymdWnN8XMDZh94h8' limit 1
update `user_password_resets` set `code` = '132579', `created_at` = '2024-07-25 13:38:34', `token` = 'mHwsSiBVYk2gbmk91tUCzYZUyqtXpTqKlWXG8GAYNjQN22hr7HbH8JqMgUCumm1UymdWnN8XMDZh94h8' where `token` = 'mHwsSiBVYk2gbmk91tUCzYZUyqtXpTqKlWXG8GAYNjQN22hr7HbH8JqMgUCumm1UymdWnN8XMDZh94h8'