app/Http/Controllers/User/Auth/RegisterController.php

                $validated['sms_verified']    = false;
                $validated['mobile']        = remove_speacial_char($validated['phone']);
                $complete_phone             = $validated['mobile'];
                if(User::where('full_mobile',$complete_phone)->exists()) {
---
select exists(select * from `users` where `full_mobile` = '880123456781') as `exists`

                        'phone'     => __('Phone number is already exists'),
                    ]);
                }
                if(Agent::where('full_mobile',$complete_phone)->exists()) {
---
select exists(select * from `agents` where `full_mobile` = '880123456781') as `exists`

                        'phone'     => __('Phone number is already exists in agent.'),
                    ]);
                }
                if(Merchant::where('full_mobile',$complete_phone)->exists()) {
---
select exists(select * from `merchants` where `full_mobile` = '880123456781') as `exists`