app/Http/Controllers/User/Auth/RegisterController.php

select * from `users` where `full_mobile` = '1777777777' limit 1
select * from `agents` where `full_mobile` = '1777777777' limit 1
select * from `merchants` where `full_mobile` = '1777777777' limit 1
---
    public function sendVerifyCode(Request $request){
        $basic_settings = $this->basic_settings;
        if($basic_settings->agree_policy){
            $agree = 'required';
        }else{
            $agree = '';
        }

        $validator = Validator::make($request->all(),[
            'register_type' => 'required|in:'.global_const()::PHONE.','.global_const()::EMAIL,
            'credentials' => ['required', function ($attribute, $value, $fail) use ($request) {
                if ($request->register_type == global_const()::PHONE && !preg_match('/^[0-9]{10,15}$/', $value)) {
                    $fail('The ' . $attribute . ' must be a valid phone number.');
                }
                if ($request->register_type == global_const()::EMAIL && !filter_var($value, FILTER_VALIDATE_EMAIL)) {
                    $fail('The ' . $attribute . ' must be a valid email address.');
                }
            }],
            'agree'                 =>  $agree,

        ]);
        $validated = $validator->validate();
        if($validated['register_type'] == GlobalConst::PHONE){
            $exist              = User::where('full_mobile',$validated['credentials'])->first();
            $exists_agent       = Agent::where('full_mobile',$validated['credentials'])->first();
            $exists_merchant    = Merchant::where('full_mobile',$validated['credentials'])->first();

select * from `users` where `email` = 'user210@appdevs.net' limit 1
select * from `agents` where `email` = 'user210@appdevs.net' limit 1
select * from `merchants` where `email` = 'user210@appdevs.net' limit 1
---
            };
            return redirect()->route('user.sms.verify',$data['token'])->with(['success' => [__('Verification code sended to your phone number.')]]);
        }else{
            $exist              = User::where('email',$validated['credentials'])->first();
            $exists_agent       = Agent::where('email',$validated['credentials'])->first();
            $exists_merchant    = Merchant::where('email',$validated['credentials'])->first();

delete from `user_authorizations` where `id` = 36
delete from `user_authorizations` where `id` = 15
---
    public function verifyCode(Request $request,$token){
        $request->merge(['token' => $token]);
        $request->validate([
            'token'     => "required|string|exists:user_authorizations,token",
            'code'      => "required|array",
            'code.*'    => "required|numeric",
        ]);
        $code = $request->code;
        $code = implode("",$code);
        $otp_exp_sec = BasicSettingsProvider::get()->otp_exp_seconds ?? GlobalConst::DEFAULT_TOKEN_EXP_SEC;
        $auth_column = UserAuthorization::where("token",$request->token)->where("code",$code)->first();
        if(!$auth_column){
            return back()->with(['error' => [__('The verification code does not match')]]);
        }
        if($auth_column->created_at->addSeconds($otp_exp_sec) < now()) {
            $auth_column->delete();
            return redirect()->route('user.register')->with(['error' => [__('Session expired. Please try again')]]);
        }
        $register_type              = session()->get('register_data.register_type');
        Session::put('register_data',[
            'credentials'           => $auth_column->phone,
            'register_type'         => $register_type,
            'sms_verified'          => true,
        ]);
        try{
            $auth_column->delete();

delete from `user_authorizations` where `id` = 38
---
    public function EmailVerifyCode(Request $request,$token){
        $request->merge(['token' => $token]);
        $request->validate([
            'token'     => "required|string|exists:user_authorizations,token",
            'code'      => "required|array",
            'code.*'    => "required|numeric",
        ]);
        $code = $request->code;
        $code = implode("",$code);

        $otp_exp_sec = BasicSettingsProvider::get()->otp_exp_seconds ?? GlobalConst::DEFAULT_TOKEN_EXP_SEC;
        $auth_column = UserAuthorization::where("token",$request->token)->where("code",$code)->first();
        if(!$auth_column){
            return back()->with(['error' => [__('The verification code does not match')]]);
        }
        if($auth_column->created_at->addSeconds($otp_exp_sec) < now()) {
            $auth_column->delete();

delete from `user_authorizations` where `id` = 40
delete from `user_authorizations` where `id` = 26
---
    public function smsOtpVerifyCode(Request $request,$token){
        $request->merge(['token' => $token]);
        $request->validate([
            'token'     => "required|string|exists:user_authorizations,token",
            'code'      => "required|array",
            'code.*'    => "required|numeric",
        ]);
        $code = $request->code;
        $code = implode("",$code);

        $otp_exp_sec = BasicSettingsProvider::get()->otp_exp_seconds ?? GlobalConst::DEFAULT_TOKEN_EXP_SEC;
        $auth_column = UserAuthorization::where("token",$request->token)->where("code",$code)->first();
        if(!$auth_column){
            return back()->with(['error' => [__('The verification code does not match')]]);
        }
        if($auth_column->created_at->addSeconds($otp_exp_sec) < now()) {
            $auth_column->delete();
            return redirect()->route('user.register.kyc')->with(['error' => [__('Session expired. Please try again')]]);
        }

        try{
            $auth_column->delete();

update `users` set `kyc_verified` = 2, `users`.`updated_at` = '2024-08-09 14:47:44' where `id` = 24
---
                DB::beginTransaction();
                try{
                    DB::table('user_kyc_data')->updateOrInsert(["user_id" => $user->id],$create);
                    $user->update([
                        'kyc_verified'  => GlobalConst::PENDING,
                    ]);

delete from `user_authorizations` where `id` = 39
---
    public function EmailOtpVerifyCode(Request $request,$token){
        $request->merge(['token' => $token]);
        $request->validate([
            'token'     => "required|string|exists:user_authorizations,token",
            'code'      => "required|array",
            'code.*'    => "required|numeric",
        ]);
        $code = $request->code;
        $code = implode("",$code);

        $otp_exp_sec = BasicSettingsProvider::get()->otp_exp_seconds ?? GlobalConst::DEFAULT_TOKEN_EXP_SEC;
        $auth_column = UserAuthorization::where("token",$request->token)->where("code",$code)->first();

        if(!$auth_column){
            return back()->with(['error' => [__('The verification code does not match')]]);
        }
        if($auth_column->created_at->addSeconds($otp_exp_sec) < now()) {

            $auth_column->delete();

select exists(select * from `users` where `username` = 'testuser') as `exists`
select exists(select * from `agents` where `username` = 'testuser') as `exists`
select exists(select * from `merchants` where `username` = 'testuser') as `exists`
---
    public function register(Request $request)
    {
        $basic_settings             = $this->basic_settings;
        $validated = $this->validator($request->all())->validate();
        if($basic_settings->kyc_verification == true){
            $user_kyc_fields = SetupKyc::userKyc()->first()->fields ?? [];
            $validation_rules = $this->generateValidationRules($user_kyc_fields);
            $kyc_validated = Validator::make($request->all(),$validation_rules)->validate();
            $get_values = $this->registerPlaceValueWithFields($user_kyc_fields,$kyc_validated);
        }else{
            $get_values     = [];
        }
        $register_data      = session()->get('register_data');

        if($register_data != null && $register_data['sms_verified'] == true){
            if(User::where('username',$validated['username'])->exists()){
                throw ValidationException::withMessages([
                    'username' => _("The username has already been taken.")
                ]);
            }
            if(Agent::where('username',$validated['username'])->exists()){
                throw ValidationException::withMessages([
                    'username' => _("The username has already been taken.")
                ]);
            }
            if(Merchant::where('username',$validated['username'])->exists()){

select exists(select * from `users` where `full_mobile` = '17777000000') as `exists`
---
            $validated['mobile']        = remove_speacial_char($validated['phone']);
            $complete_phone             = $validated['mobile'];

            if(User::where('full_mobile',$complete_phone)->exists()) {

select exists(select * from `agents` where `full_mobile` = '17777000000') as `exists`
---
                    'phone'     => __('Phone number is already exists'),
                ]);
            }
            if(Agent::where('full_mobile',$complete_phone)->exists()) {

select exists(select * from `merchants` where `full_mobile` = '17777000000') as `exists`
---
                    'phone'     => __('Phone number is already exists in agent.'),
                ]);
            }
            if(Merchant::where('full_mobile',$complete_phone)->exists()) {

select * from `users` where `email` = 'amirsohelto@gmail.com' limit 1
---


            if($validated['email'] != '' || $validated['email'] != null){
                $exist = User::where('email',$validated['email'])->first();

update `users` set `kyc_verified` = 2, `users`.`updated_at` = '2024-08-08 16:55:13' where `id` = 18
---
                    DB::beginTransaction();
                    try{
                        DB::table('user_kyc_data')->updateOrInsert(["user_id" => $user->id],$create);
                        $user->update([
                            'kyc_verified'  => GlobalConst::PENDING,
                        ]);

select exists(select * from `users` where `username` = 'dfsfs') as `exists`
---

        }else{

            if(User::where('username',$validated['username'])->exists()){

select exists(select * from `agents` where `username` = 'dfsfs') as `exists`
---
                    'username' => _("The username has already been taken.")
                ]);
            }
            if(Agent::where('username',$validated['username'])->exists()){

select exists(select * from `merchants` where `username` = 'dfsfs') as `exists`
---
                    'username' => _("The username has already been taken.")
                ]);
            }
            if(Merchant::where('username',$validated['username'])->exists()){

select * from `users` where `full_mobile` = '880123456781' limit 1
select exists(select * from `users` where `full_mobile` = '880124564564') as `exists`
---
                $validated['sms_verified']    = false;
                $validated['mobile']        = remove_speacial_char($validated['phone']);
                $complete_phone             = $validated['mobile'];
                if(User::where('full_mobile',$complete_phone)->exists()) {

select exists(select * from `agents` where `full_mobile` = '880124564564') as `exists`
---
                        'phone'     => __('Phone number is already exists'),
                    ]);
                }
                if(Agent::where('full_mobile',$complete_phone)->exists()) {

select exists(select * from `merchants` where `full_mobile` = '880124564564') as `exists`
---
                        'phone'     => __('Phone number is already exists in agent.'),
                    ]);
                }
                if(Merchant::where('full_mobile',$complete_phone)->exists()) {

select * from `users` where `full_mobile` = '880124564564' limit 1
---


            if($validated['phone'] != '' || $validated['phone'] != null){
                $exist = User::where('full_mobile',$validated['phone'])->first();

insert into `users` (`firstname`, `lastname`, `email`, `password`, `username`, `sms_verified`, `mobile`, `full_mobile`, `email_verified`, `kyc_verified`, `address`, `updated_at`, `created_at`) values ('Amir', 'Sohel', 'amirsohelo@gmail.com', '$2y$10$8havYnRrYmYKB8V5jZMlUeBoHTLoCu/gWvxFL1jHe4L73Rps/0uY2', 'rafi', 1, '7687678678678', '7687678678678', 1, 1, '{\"country\":\"Bangladesh\",\"city\":\"Dhaka\",\"zip\":\"1230\",\"state\":\"\",\"address\":\"\"}', '2024-07-25 10:31:04', '2024-07-25 10:31:04')
---

                return $this->registered($request, $user);
            }else{
                $data = event(new Registered($user = $this->create($validated)));

insert into `users` (`firstname`, `lastname`, `email`, `password`, `username`, `sms_verified`, `mobile`, `full_mobile`, `email_verified`, `kyc_verified`, `address`, `updated_at`, `created_at`) values ('AppDevs', 'Devs', 'user412@appdevs.net', '$2y$10$4ANlkOJVkP1fu5NaLjQMKOIe7lu.AYbDfS89a/QIfX7Es/Mu0Mi1m', 'dfsfs', 0, '880124564564', '880124564564', 0, 1, '{\"country\":\"Bangladesh\",\"city\":\"Dhaka\",\"zip\":\"1230\",\"state\":\"\",\"address\":\"\"}', '2024-07-26 15:19:20', '2024-07-26 15:19:20')
---
    protected function create(array $data)
    {
        return User::create($data);