app/Http/Controllers/Api/User/Auth/LoginController.php

            }
        }else{
            if($data['phone'] != '' || $data['phone'] != null){
                $phone = User::where('full_mobile',$data['phone'])->first();
---
select * from `users` where `full_mobile` = '54564564654' limit 1

                    ];
                    DB::beginTransaction();
                    try{
                        $oldToken = UserAuthorization::where("phone",$data['phone'])->get();
---
select * from `user_authorizations` where `phone` = '54564564654'