app/Http/Controllers/Api/User/Auth/LoginController.php

        }
        $data               = $request->all();
        $userName           = $data['username'];
        $check_user_name    = User::where('username',$userName)->first();
---
select * from `users` where `username` = 'dasds510' limit 1

            $error = ['error'=>[__('Username already exist')]];
            return ApiHelpers::validation($error);
        }
        $check_user_name_agent = Agent::where('username',$userName)->first();
---
select * from `agents` where `username` = 'dasds510' limit 1

            $error = ['error'=>[__('Username already exist')]];
            return ApiHelpers::validation($error);
        }
        $check_user_name_merchant = Merchant::where('username',$userName)->first();
---
select * from `merchants` where `username` = 'dasds510' limit 1

        if(($request->type == 'phone' && $request->phone != '') || ($request->type == 'phone' && $request->phone != null)){
            $data['mobile']             = remove_speacial_char($data['phone']);
            $complete_phone             = $data['mobile'];
            $mobile_validate            = User::where('full_mobile',$complete_phone)->first();
            $mobile_validate_agent      = Agent::where('full_mobile',$complete_phone)->first();
            $mobile_validate_merchant   = Merchant::where('full_mobile',$complete_phone)->first();
---
select * from `users` where `full_mobile` = '17777774445' limit 1
select * from `agents` where `full_mobile` = '17777774445' limit 1
select * from `merchants` where `full_mobile` = '17777774445' limit 1

            }
            $data['full_mobile']       = $complete_phone;
            if($data['email'] != '' || $data['email'] != null){
                $email_validate            = User::where('email',$data['email'])->first();
                $email_validate_agent      = Agent::where('email',$data['email'])->first();
                $email_validate_merchant   = Merchant::where('email',$data['email'])->first();
---
select * from `users` where `email` = 'amirsohelto@gmail.com' limit 1
select * from `agents` where `email` = 'amirsohelto@gmail.com' limit 1
select * from `merchants` where `email` = 'amirsohelto@gmail.com' limit 1

                $user->sms_verified     = true;
                $user->email_verified   = false;
                $user->kyc_verified     = ($basic_settings->kyc_verification == true) ? false : true;
                $user->save();
---
insert into `users` (`firstname`, `lastname`, `email`, `mobile`, `full_mobile`, `password`, `username`, `address`, `status`, `sms_verified`, `email_verified`, `kyc_verified`, `updated_at`, `created_at`) values ('Ayon', 'Islam', 'user4545@appdevs.net', '100000211', '100000211', '$2y$10$q.KkmxV1QDKCpnN1YTJNr.QOG7C9Rz01LCfCErhM9Cx28ouVxKfHK', 'rtertertert', '{\"address\":\"\",\"city\":\"Dhaka\",\"zip\":\"1230\",\"country\":\"Bangladesh\",\"state\":\"\"}', 1, 1, 0, 1, '2024-07-29 11:35:48', '2024-07-29 11:35:48')



        }else if(($request->type == 'email' && $request->email != '') || ($request->type == 'email' && $request->email != null)){
            $email_validate            = User::where('email',$data['email'])->first();
            $email_validate_agent      = Agent::where('email',$data['email'])->first();
            $email_validate_merchant   = Merchant::where('email',$data['email'])->first();
---
select * from `users` where `email` = 'user0@gmail.com' limit 1
select * from `agents` where `email` = 'user0@gmail.com' limit 1
select * from `merchants` where `email` = 'user0@gmail.com' limit 1

            if($data['phone'] != '' || $data['phone'] != null){
                $data['mobile']             = remove_speacial_char($data['phone']);
                $complete_phone             = $data['mobile'];
                $mobile_validate            = User::where('full_mobile',$complete_phone)->first();
                $mobile_validate_agent      = Agent::where('full_mobile',$complete_phone)->first();
                $mobile_validate_merchant   = Merchant::where('full_mobile',$complete_phone)->first();
---
select * from `users` where `full_mobile` = '741025896321' limit 1
select * from `agents` where `full_mobile` = '741025896321' limit 1
select * from `merchants` where `full_mobile` = '741025896321' limit 1

                ];
                DB::beginTransaction();
                try{
                    $oldToken = UserAuthorization::where("phone",$data['phone'])->get();
---
select * from `user_authorizations` where `phone` = '741025896321'

                $user->sms_verified     = false;
                $user->email_verified   = true;
                $user->kyc_verified     = ($basic_settings->kyc_verification == true) ? false : true;
                $user->save();
---
insert into `users` (`firstname`, `lastname`, `email`, `mobile`, `full_mobile`, `password`, `username`, `address`, `status`, `sms_verified`, `email_verified`, `kyc_verified`, `updated_at`, `created_at`) values ('Ayon', 'Islam', 'user0@gmail.com', '741025896321', '741025896321', '$2y$10$eaIYRzTB302WfG5XvKUjd.enEFCHxIhimxF.8msP1uw5T7v2ZHVYi', 'dasds510', '{\"address\":\"\",\"city\":\"Dhaka\",\"zip\":\"1230\",\"country\":\"Bangladesh\",\"state\":\"\"}', 1, 0, 1, 1, '2024-08-09 15:49:54', '2024-08-09 15:49:54')

                $user->sms_verified     = false;
                $user->email_verified   = true;
                $user->kyc_verified     = ($basic_settings->kyc_verification == true) ? false : true;
                $user->save();
---
insert into `users` (`firstname`, `lastname`, `email`, `mobile`, `full_mobile`, `password`, `username`, `address`, `status`, `sms_verified`, `email_verified`, `kyc_verified`, `updated_at`, `created_at`) values ('Ayon', 'Islam', 'user61@gmail.com', '', '', '$2y$10$m.64DGTGc4PVMh1/KlFKieOxMp0IyW2sOyj7629HDeBVhxa6er45m', 'dasds5567', '{\"address\":\"\",\"city\":\"Dhaka\",\"zip\":\"1230\",\"country\":\"Bangladesh\",\"state\":\"\"}', 1, 1, 0, 1, '2024-08-09 15:44:04', '2024-08-09 15:44:04')

    public function createQr($user){
		$user = $user;
	    $qrCode = $user->qrCode()->first();
        $in['user_id'] = $user->id;;
        $in['receiver_type'] = 'User';
        $in['sender_type'] = 'User';
        $data 				= [
			'receiver_type' => 'User',
			'sender_type' => 'User',
			'username'			=> $user->username,
			'amount'		=> null,
		];
        $in['qr_code'] 		= $data;
	    if(!$qrCode){
            UserQrCode::create($in);
---
select * from `user_qr_codes` where `user_qr_codes`.`user_id` = 32 and `user_qr_codes`.`user_id` is not null limit 1
insert into `user_qr_codes` (`user_id`, `receiver_type`, `sender_type`, `qr_code`, `updated_at`, `created_at`) values (32, 'User', 'User', '{\"receiver_type\":\"User\",\"sender_type\":\"User\",\"username\":\"dasds510\",\"amount\":null}', '2024-08-09 15:49:54', '2024-08-09 15:49:54')