app/Http/Controllers/Api/User/Auth/LoginController.php


        $mobile                     = remove_speacial_char($data['phone']);
        $complete_phone             = $mobile;
        $mobile_validate            = User::where('full_mobile',$complete_phone)->first();
        $mobile_validate_agent      = Agent::where('full_mobile',$complete_phone)->first();
        $mobile_validate_merchant   = Merchant::where('full_mobile',$complete_phone)->first();
---
select * from `users` where `full_mobile` = '100000211' limit 1
select * from `agents` where `full_mobile` = '100000211' limit 1
select * from `merchants` where `full_mobile` = '100000211' limit 1

    public function createQr($user){
		$user = $user;
	    $qrCode = $user->qrCode()->first();
        $in['user_id'] = $user->id;;
        $in['receiver_type'] = 'User';
        $in['sender_type'] = 'User';
        $data 				= [
			'receiver_type' => 'User',
			'sender_type' => 'User',
			'username'			=> $user->username,
			'amount'		=> null,
		];
        $in['qr_code'] 		= $data;
	    if(!$qrCode){
            UserQrCode::create($in);
---
select * from `user_qr_codes` where `user_qr_codes`.`user_id` = 18 and `user_qr_codes`.`user_id` is not null limit 1
insert into `user_qr_codes` (`user_id`, `receiver_type`, `sender_type`, `qr_code`, `updated_at`, `created_at`) values (18, 'User', 'User', '{\"receiver_type\":\"User\",\"sender_type\":\"User\",\"phone\":\"100000211\",\"amount\":null}', '2024-07-29 11:35:48', '2024-07-29 11:35:48')