app/Http/Controllers/Agent/Auth/ForgotPasswordController.php

    public function sendCode(Request $request)
    {
        $request->validate([
            'credentials'   => "required|string|max:100",
        ]);

        $user = Agent::orWhere('full_mobile',$request->credentials)
                        ->orWhere('email',$request->credentials)->first();
---
select * from `agents` where `full_mobile` = 'agent@appdevs.net' or `email` = 'agent@appdevs.net' limit 1

            $code = generate_random_code();

            try{
                AgentPasswordReset::where("agent_id",$user->id)->delete();
                $password_reset = AgentPasswordReset::create([
                    'agent_id'      => $user->id,
                    'email'         => $request->credentials,
                    'token'         => $token,
                    'code'          => $code,
                ]);
---
delete from `agent_password_resets` where `agent_id` = 1
insert into `agent_password_resets` (`agent_id`, `email`, `token`, `code`, `updated_at`, `created_at`) values (1, 'agent@appdevs.net', 'uKF1NU9BUCdONGq5urzXyVTTJBEhSnOFTRvPZbGYtdsuzkYqDbdQAjJBSeb2T72SclNFeddlpDvFE3yz', '812511', '2024-07-25 13:47:37', '2024-07-25 13:47:37')