app/Http/Controllers/Agent/BillPayController.php

    public function index() {
        $page_title = __("Bill Pay");
        $billPayCharge = TransactionSetting::where('slug','bill_pay')->where('status',1)->first();
        $billType = BillPayCategory::active()->orderByDesc('id')->get();
        $transactions = Transaction::agentAuth()->billPay()->latest()->take(10)->get();
---
select * from `transaction_settings` where `slug` = 'bill_pay' and `status` = 1 limit 1
select * from `transactions` where `agent_id` = 1 and `type` = 'BILL-PAY' order by `created_at` desc limit 10