app/Http/Controllers/Agent/MoneyInController.php

select * from `transaction_settings` where `slug` = 'money-in' and `status` = 1 limit 1
select * from `transactions` where `agent_id` = 1 and `type` = 'MONEY-IN' order by `created_at` desc limit 10
---
    public function index() {
        $page_title = __("Money In");
        $moneyInCharge = TransactionSetting::where('slug','money-in')->where('status',1)->first();
        $transactions = Transaction::agentAuth()->moneyIn()->latest()->take(10)->get();

select * from `users` where `email` = 'user@ap' limit 1
---
    public function checkUser(Request $request){
        $email = $request->email;
        $exist['data'] = User::where('email',$email)->first();

select * from `basic_settings` limit 1
select * from `user_wallets` where `user_id` = 1 limit 1
select * from `transaction_settings` where `slug` = 'money-in' and `status` = 1 limit 1
---
    public function confirmedMoneyIn(Request $request){
        $validated = Validator::make($request->all(),[
            'amount' => 'required|numeric|gt:0',
            'email' => 'required|email'
        ])->validate();
        $basic_setting = BasicSettings::first();

        $sender_wallet = AgentWallet::auth()->active()->first();
        if(!$sender_wallet){
            return back()->with(['error' => [__('Agent wallet not found')]]);
        }
        if( $sender_wallet->agent->email == $validated['email']){
            return back()->with(['error' => [__("Can't Money-In to your own")]]);
        }
        $field_name = "username";
        if(check_email($validated['email'])) {
            $field_name = "email";
        }
        $receiver = User::where($field_name,$validated['email'])->active()->first();
        if(!$receiver){
            return back()->with(['error' => [__("Receiver doesn't exists or Receiver is temporary banned")]]);
        }
        $receiver_wallet = UserWallet::where("user_id",$receiver->id)->first();

        if(!$receiver_wallet){
            return back()->with(['error' => [__("Receiver wallet not found")]]);
        }

        $trx_charges =  TransactionSetting::where('slug','money-in')->where('status',1)->first();

insert into `agent_profits` (`agent_id`, `transaction_id`, `percent_charge`, `fixed_charge`, `total_charge`, `created_at`) values (1, 3, 0.1, 1, 1.1, '2024-07-27 10:13:52')
---
    public function agentProfitInsert($id,$authWallet,$charges) {
        DB::beginTransaction();
        try{
            DB::table('agent_profits')->insert([
                'agent_id'          => $authWallet->agent->id,
                'transaction_id'    => $id,
                'percent_charge'    => $charges['agent_percent_commission'],
                'fixed_charge'      => $charges['agent_fixed_commission'],
                'total_charge'      => $charges['agent_total_commission'],
                'created_at'        => now(),
            ]);

insert into `transaction_charges` (`transaction_id`, `percent_charge`, `fixed_charge`, `total_charge`, `created_at`) values (3, 0.2, 1, 1.2, '2024-07-27 10:13:52')
insert into `agent_notifications` (`type`, `agent_id`, `message`, `updated_at`, `created_at`) values ('MONEY-IN', 1, '{\"title\":\"Money IN\",\"message\":\"Money In To  Test User 10 USD Successful\",\"image\":\"http:\/\/localhost\/customization\/paywai\/public\/backend\/images\/default\/default.webp\"}', '2024-07-27 10:13:52', '2024-07-27 10:13:52')
insert into `admin_notifications` (`type`, `admin_id`, `message`, `updated_at`, `created_at`) values ('MONEY-IN', 1, '{\"title\":\"Money In To (appdevs)\",\"message\":\"Money In To  Test User 10 USD Successful\",\"image\":\"http:\/\/localhost\/customization\/paywai\/public\/backend\/images\/default\/default.webp\"}', '2024-07-27 10:13:52', '2024-07-27 10:13:52')
---
    public function insertSenderCharges($id,$charges,$sender_wallet,$receiver_wallet) {
        DB::beginTransaction();
        try{
            DB::table('transaction_charges')->insert([
                'transaction_id'    => $id,
                'percent_charge'    => $charges['percent_charge'],
                'fixed_charge'      => $charges['fixed_charge'],
                'total_charge'      => $charges['total_charge'],
                'created_at'        => now(),
            ]);
            DB::commit();

            //store notification
            $notification_content = [
                'title'         =>__("Money IN"),
                'message'       => "Money In To  ".$receiver_wallet->user->fullname.' ' .$charges['sender_amount'].' '.$charges['sender_currency']." Successful",
                'image'         =>  get_image($sender_wallet->agent->image,'agent-profile'),
            ];
            AgentNotification::create([
                'type'      => NotificationConst::MONEYIN,
                'agent_id'  => $sender_wallet->agent->id,
                'message'   => $notification_content,
            ]);

            //admin create notifications
            $notification_content['title'] = __('Money In To').' ('.$receiver_wallet->user->username.')';
            AdminNotification::create([
                'type'      => NotificationConst::MONEYIN,
                'admin_id'  => 1,
                'message'   => $notification_content,
            ]);

update `user_wallets` set `balance` = 1010, `user_wallets`.`updated_at` = '2024-07-27 10:13:52' where `id` = 1
---
    public function updateReceiverWalletBalance($receiverWallet,$recipient_amount) {
        $receiverWallet->update([
            'balance'   => $recipient_amount,
        ]);

insert into `transaction_charges` (`transaction_id`, `percent_charge`, `fixed_charge`, `total_charge`, `created_at`) values (4, 0, 0, 0, '2024-07-27 10:13:52')
insert into `user_notifications` (`type`, `user_id`, `message`, `updated_at`, `created_at`) values ('MONEY-IN', 1, '{\"title\":\"Money In\",\"message\":\"Money In From  Test Agent 10 USD Successful\",\"image\":\"http:\/\/localhost\/customization\/paywai\/public\/backend\/images\/default\/default.webp\"}', '2024-07-27 10:13:53', '2024-07-27 10:13:53')
insert into `admin_notifications` (`type`, `admin_id`, `message`, `updated_at`, `created_at`) values ('MONEY-IN', 1, '{\"title\":\"Money In From (testagent)\",\"message\":\"Money In From  Test Agent 10 USD Successful\",\"image\":\"http:\/\/localhost\/customization\/paywai\/public\/backend\/images\/default\/default.webp\"}', '2024-07-27 10:13:53', '2024-07-27 10:13:53')
---
    public function insertReceiverCharges($id,$charges,$sender_wallet,$receiver_wallet) {
        DB::beginTransaction();
        try{
            DB::table('transaction_charges')->insert([
                'transaction_id'    => $id,
                'percent_charge'    => 0,
                'fixed_charge'      => 0,
                'total_charge'      => 0,
                'created_at'        => now(),
            ]);
            DB::commit();

            //store notification
            $notification_content = [
                'title'         =>__("Money In"),
                'message'       => "Money In From  ".$sender_wallet->agent->fullname.' ' .$charges['receiver_amount'].' '.$charges['receiver_currency']." Successful",
                'image'         => get_image($receiver_wallet->user->image,'user-profile'),
            ];
            UserNotification::create([
                'type'      => NotificationConst::MONEYIN,
                'user_id'   => $receiver_wallet->user->id,
                'message'   => $notification_content,
            ]);
            DB::commit();

            //admin notification
            $notification_content['title'] = __('Money In From').' ('.$sender_wallet->agent->username.')';
            $data = AdminNotification::create([
                'type'      => NotificationConst::MONEYIN,
                'admin_id'  => 1,
                'message'   => $notification_content,
            ]);