app/Http/Controllers/Agent/ReceiveMoneyController.php

    public function index() {
        $page_title = __("Receive Money");
        $user = auth()->user();
        $user->createQr();
        $userQrCode = $user->qrCode()->first();
---
select * from `agent_qr_codes` where `agent_qr_codes`.`agent_id` = 1 and `agent_qr_codes`.`agent_id` is not null limit 1