app/Http/Controllers/Agent/SendMoneyController.php

    public function index() {
        $page_title = __("Send Money");
        $sendMoneyCharge = TransactionSetting::where('slug','transfer')->where('status',1)->first();
        $transactions = Transaction::agentAuth()->senMoney()->latest()->take(10)->get();
---
select * from `transaction_settings` where `slug` = 'transfer' and `status` = 1 limit 1
select * from `transactions` where `agent_id` = 1 and `type` = 'TRANSFER-MONEY' order by `created_at` desc limit 10