app/Traits/User/UserPartials.php

	public function createQr(){
		$user = $this->user();
	    $qrCode = $user->qrCode()->first();
        $in['user_id'] = $user->id;
        $in['receiver_type'] = 'User';
        $in['sender_type'] = 'User';
        $data 				= [
			'receiver_type' => 'User',
			'sender_type' 	=> 'User',
			'username'			=> $user->username,
			'amount'		=> null,
		];
        $in['qr_code'] 		= $data;
	    if(!$qrCode){
            UserQrCode::create($in);
---
select * from `user_qr_codes` where `user_qr_codes`.`user_id` = 18 and `user_qr_codes`.`user_id` is not null limit 1
insert into `user_qr_codes` (`user_id`, `receiver_type`, `sender_type`, `qr_code`, `updated_at`, `created_at`) values (18, 'User', 'User', '{\"receiver_type\":\"User\",\"sender_type\":\"User\",\"username\":\"testuser\",\"amount\":null}', '2024-08-08 16:55:13', '2024-08-08 16:55:13')