app/Models/Merchants/Merchant.php

select count(*) as aggregate from `merchant_login_logs` where `merchant_login_logs`.`merchant_id` = 15 and `merchant_login_logs`.`merchant_id` is not null
---
    public function getLastLoginAttribute() {
        if($this->loginLogs()->count() > 0) {