app/Http/Controllers/SiteController.php

select * from `basic_settings` limit 1
select * from `app_settings` limit 1
---
    public function home(){

        $basic_settings = BasicSettings::first();
        $page_title = $basic_settings->site_title??"Home";
        $app_urls = AppSettings::first();

select * from `users` where `username` = 'appdev' limit 1
select * from `agents` where `username` = 'appdev' limit 1
select * from `merchants` where `username` = 'appdev' limit 1
---
    public function checkUserUniqueName(Request $request){
        $validator      = Validator::make($request->all(),[
            'userName'  => 'required|string'
        ]);
        if($validator->fails()){
            return Response::error($validator->errors()->all());
        }
        $validated      = $validator->validate();

        $user_name          = User::where('username',$validated['userName'])->first();
        $agent_name         = Agent::where('username',$validated['userName'])->first();
        $merchant_name      = Merchant::where('username',$validated['userName'])->first();

select * from `users` where `username` = 'testag' limit 1
select * from `agents` where `username` = 'testag' limit 1
select * from `merchants` where `username` = 'testag' limit 1
---
    public function checkAgentUniqueName(Request $request){
        $validator      = Validator::make($request->all(),[
            'userName'  => 'required|string'
        ]);
        if($validator->fails()){
            return Response::error($validator->errors()->all());
        }
        $validated      = $validator->validate();

        $user_name          = User::where('username',$validated['userName'])->first();
        $agent_name         = Agent::where('username',$validated['userName'])->first();
        $merchant_name      = Merchant::where('username',$validated['userName'])->first();

select * from `users` where `username` = 'rew' limit 1
select * from `agents` where `username` = 'rew' limit 1
select * from `merchants` where `username` = 'rew' limit 1
---
    public function checkMerchantUniqueName(Request $request){
        $validator      = Validator::make($request->all(),[
            'userName'  => 'required|string'
        ]);
        if($validator->fails()){
            return Response::error($validator->errors()->all());
        }
        $validated      = $validator->validate();

        $user_name          = User::where('username',$validated['userName'])->first();
        $agent_name         = Agent::where('username',$validated['userName'])->first();
        $merchant_name      = Merchant::where('username',$validated['userName'])->first();