app/Http/Controllers/Admin/AgentCareController.php

    public function index()
    {
        $page_title = __("All Agents");
        $agents = Agent::orderBy('id', 'desc')->paginate(12);
---
select * from `agents` order by `id` desc limit 12 offset 0
select count(*) as aggregate from `agents`