app/Http/Controllers/Admin/UserCareController.php

    public function index()
    {
        $page_title = __("All Users");
        $users = User::orderBy('id', 'desc')->paginate(12);
---
select * from `users` order by `id` desc limit 12 offset 0
select count(*) as aggregate from `users`

    public function userDetails($username)
    {
        $page_title = __("User Details");
        $user = User::where('username', $username)->first();
        if(!$user) return back()->with(['error' => [__('Oops! User not exists')]]);

        $balance = UserWallet::where('user_id', $user->id)->first()->balance ?? 0;
        $add_money_amount = Transaction::toBase()->where('user_id', $user->id)->where('type', PaymentGatewayConst::TYPEADDMONEY)->where('status', 1)->sum('request_amount');
        $money_out_amount = Transaction::toBase()->where('user_id', $user->id)->where('type', PaymentGatewayConst::TYPEMONEYOUT)->where('status', 1)->sum('request_amount');
        $total_transaction = Transaction::toBase()->where('user_id', $user->id)->where('status', 1)->sum('request_amount');
---
select * from `users` where `username` = 'testuser' limit 1
select * from `user_wallets` where `user_id` = 17 limit 1
select sum(`request_amount`) as aggregate from `transactions` where `user_id` = 17 and `type` = 'ADD-MONEY' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `user_id` = 17 and `type` = 'MONEY-OUT' and `status` = 1
select sum(`request_amount`) as aggregate from `transactions` where `user_id` = 17 and `status` = 1

    public function kycDetails($username) {
        $user = User::where("username",$username)->first();
---
select * from `users` where `username` = 'testuser' limit 1