app/Http/Controllers/Admin/WebSettingsController.php

    public function basicSettings()
    {
        $page_title = __("Basic Settings");
        $basic_settings   = BasicSettings::first();
---
select * from `basic_settings` limit 1

    public function basicSettingsActivationUpdate(Request $request)
    {
        $validator = Validator::make($request->all(), [
            'status'                    => 'required|boolean',
            'input_name'                => 'required|string',
        ]);

        if ($validator->stopOnFirstFailure()->fails()) {
            $error = ['error' => $validator->errors()];
            return Response::error($error, null, 400);
        }
        $validated = $validator->validate();

        $basic_settings = BasicSettingsProvider::get();
        // Check Email configure
        if ($validated['input_name'] == "email_verification") {
            if (!$basic_settings->mail_config) {
                $warning = ['warning' => [__("You have to configure your system mail first.")]];
                return Response::warning($warning, null, 400);
            }
        }

        if($validated['input_name'] == "kyc_verification") {
            $data = SetupKyc::first()->fields ?? null;
---
select * from `setup_kycs` limit 1



        try {
            $basic_settings->update([
                $validated['input_name'] => $validated['status'],
            ]);
---
update `basic_settings` set `merchant_sms_notification` = 0, `basic_settings`.`updated_at` = '2024-07-26 12:53:38' where `id` = 1