app/Traits/Agent/UserPartials.php

	public function createQr(){
		$user = $this->user();
	    $qrCode = $user->qrCode()->first();
---
select * from `agent_qr_codes` where `agent_qr_codes`.`agent_id` = 1 and `agent_qr_codes`.`agent_id` is not null limit 1